RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_flexray.h
/***************************************************************************//**
* \file cyip_flexray.h
*
* \brief
* FLEXRAY IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_FLEXRAY_H_
#define _CYIP_FLEXRAY_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                   FLEXRAY
*******************************************************************************/

#define FLEXRAY_SECTION_SIZE                    0x00001000UL

/**
  * \brief FlexRay Bus Interface (FLEXRAY)
  */
typedef struct {
  __IOM uint32_t CTL;                           /*!< 0x00000000 Control Register */
  __IOM uint32_t DMA_CTL;                       /*!< 0x00000004 DMA Control Register */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t TEST1;                         /*!< 0x00000010 Test Register 1 */
  __IOM uint32_t TEST2;                         /*!< 0x00000014 Test Register 2 */
   __IM uint32_t RESERVED1;
   __OM uint32_t LCK;                           /*!< 0x0000001C Lock Register */
  __IOM uint32_t EIR;                           /*!< 0x00000020 Error Interrupt Register */
  __IOM uint32_t SIR;                           /*!< 0x00000024 Status Interrupt Register */
  __IOM uint32_t EILS;                          /*!< 0x00000028 Error Interrupt Line Select */
  __IOM uint32_t SILS;                          /*!< 0x0000002C Status Interrupt Line Select */
  __IOM uint32_t EIES;                          /*!< 0x00000030 Error Interrupt Enable Set */
  __IOM uint32_t EIER;                          /*!< 0x00000034 Error Interrupt Enable Reset */
  __IOM uint32_t SIES;                          /*!< 0x00000038 Status Interrupt Enable Set */
  __IOM uint32_t SIER;                          /*!< 0x0000003C Status Interrupt Enable Reset */
  __IOM uint32_t ILE;                           /*!< 0x00000040 Interrupt Line Enable */
  __IOM uint32_t T0C;                           /*!< 0x00000044 Timer 0 Configuration */
  __IOM uint32_t T1C;                           /*!< 0x00000048 Timer 1 Configuration */
  __IOM uint32_t STPW1;                         /*!< 0x0000004C Stop Watch Register 1 */
   __IM uint32_t STPW2;                         /*!< 0x00000050 Stop Watch Register 2 */
   __IM uint32_t RESERVED2[11];
  __IOM uint32_t SUCC1;                         /*!< 0x00000080 SUC Configuration Register 1 */
  __IOM uint32_t SUCC2;                         /*!< 0x00000084 SUC Configuration Register 2 */
  __IOM uint32_t SUCC3;                         /*!< 0x00000088 SUC Configuration Register 3 */
  __IOM uint32_t NEMC;                          /*!< 0x0000008C NEM Configuration Register */
  __IOM uint32_t PRTC1;                         /*!< 0x00000090 PRT Configuration Register 1 */
  __IOM uint32_t PRTC2;                         /*!< 0x00000094 PRT Configuration Register 2 */
  __IOM uint32_t MHDC;                          /*!< 0x00000098 MHD Configuration Register */
   __IM uint32_t RESERVED3;
  __IOM uint32_t GTUC1;                         /*!< 0x000000A0 GTU Configuration Register 1 */
  __IOM uint32_t GTUC2;                         /*!< 0x000000A4 GTU Configuration Register 2 */
  __IOM uint32_t GTUC3;                         /*!< 0x000000A8 GTU Configuration Register 3 */
  __IOM uint32_t GTUC4;                         /*!< 0x000000AC GTU Configuration Register 4 */
  __IOM uint32_t GTUC5;                         /*!< 0x000000B0 GTU Configuration Register 5 */
  __IOM uint32_t GTUC6;                         /*!< 0x000000B4 GTU Configuration Register 6 */
  __IOM uint32_t GTUC7;                         /*!< 0x000000B8 GTU Configuration Register 7 */
  __IOM uint32_t GTUC8;                         /*!< 0x000000BC GTU Configuration Register 8 */
  __IOM uint32_t GTUC9;                         /*!< 0x000000C0 GTU Configuration Register 9 */
  __IOM uint32_t GTUC10;                        /*!< 0x000000C4 GTU Configuration Register 10 */
  __IOM uint32_t GTUC11;                        /*!< 0x000000C8 GTU Configuration Register 11 */
   __IM uint32_t RESERVED4[13];
   __IM uint32_t CCSV;                          /*!< 0x00000100 CC Status Vector */
   __IM uint32_t CCEV;                          /*!< 0x00000104 CC Error Vector */
   __IM uint32_t RESERVED5[2];
   __IM uint32_t SCV;                           /*!< 0x00000110 Slot Counter Value */
   __IM uint32_t MTCCV;                         /*!< 0x00000114 Macrotick and Cycle Counter Value */
   __IM uint32_t RCV;                           /*!< 0x00000118 Rate Correction Value */
   __IM uint32_t OCV;                           /*!< 0x0000011C Offset Correction Value */
   __IM uint32_t SFS;                           /*!< 0x00000120 Sync Frame Status */
   __IM uint32_t SWNIT;                         /*!< 0x00000124 Symbol Window and NIT Status */
  __IOM uint32_t ACS;                           /*!< 0x00000128 Aggregated Channel Status */
   __IM uint32_t RESERVED6;
   __IM uint32_t ESID[15];                      /*!< 0x00000130 Even Sync ID [1...15] */
   __IM uint32_t RESERVED7;
   __IM uint32_t OSID[15];                      /*!< 0x00000170 Odd Sync ID [1...15] */
   __IM uint32_t RESERVED8;
   __IM uint32_t NMV1;                          /*!< 0x000001B0 Network Management Vector 1 */
   __IM uint32_t NMV2;                          /*!< 0x000001B4 Network Management Vector 2 */
   __IM uint32_t NMV3;                          /*!< 0x000001B8 Network Management Vector 3 */
   __IM uint32_t RESERVED9[81];
  __IOM uint32_t MRC;                           /*!< 0x00000300 Message RAM Configuration */
  __IOM uint32_t FRF;                           /*!< 0x00000304 FIFO Rejection Filter */
  __IOM uint32_t FRFM;                          /*!< 0x00000308 FIFO Rejection Filter Mask */
  __IOM uint32_t FCL;                           /*!< 0x0000030C FIFO Critical Level */
  __IOM uint32_t MHDS;                          /*!< 0x00000310 Message Handler Status */
   __IM uint32_t LDTS;                          /*!< 0x00000314 Last Dynamic Transmit Slot */
   __IM uint32_t FSR;                           /*!< 0x00000318 FIFO Status Register */
  __IOM uint32_t MHDF;                          /*!< 0x0000031C Message Handler Constraints Flags */
   __IM uint32_t TXRQ1;                         /*!< 0x00000320 Transmission Request 1 */
   __IM uint32_t TXRQ2;                         /*!< 0x00000324 Transmission Request 2 */
   __IM uint32_t TXRQ3;                         /*!< 0x00000328 Transmission Request 3 */
   __IM uint32_t TXRQ4;                         /*!< 0x0000032C Transmission Request 4 */
   __IM uint32_t NDAT1;                         /*!< 0x00000330 New Data 1 */
   __IM uint32_t NDAT2;                         /*!< 0x00000334 New Data 2 */
   __IM uint32_t NDAT3;                         /*!< 0x00000338 New Data 3 */
   __IM uint32_t NDAT4;                         /*!< 0x0000033C New Data 4 */
   __IM uint32_t MBSC1;                         /*!< 0x00000340 Message Buffer Status Changed 1 */
   __IM uint32_t MBSC2;                         /*!< 0x00000344 Message Buffer Status Changed 2 */
   __IM uint32_t MBSC3;                         /*!< 0x00000348 Message Buffer Status Changed 3 */
   __IM uint32_t MBSC4;                         /*!< 0x0000034C Message Buffer Status Changed 4 */
   __IM uint32_t RESERVED10[40];
   __IM uint32_t CREL;                          /*!< 0x000003F0 Core Release Register */
   __IM uint32_t ENDN;                          /*!< 0x000003F4 Endian Register */
   __IM uint32_t RESERVED11[2];
  __IOM uint32_t WRDS[64];                      /*!< 0x00000400 Write Data Section [1...64] */
  __IOM uint32_t WRHS1;                         /*!< 0x00000500 Write Header Section 1 */
  __IOM uint32_t WRHS2;                         /*!< 0x00000504 Write Header Section 2 */
  __IOM uint32_t WRHS3;                         /*!< 0x00000508 Write Header Section 3 */
   __IM uint32_t RESERVED12;
  __IOM uint32_t IBCM;                          /*!< 0x00000510 Input Buffer Command Mask */
  __IOM uint32_t IBCR;                          /*!< 0x00000514 Input Buffer Command Request */
   __IM uint32_t RESERVED13[58];
   __IM uint32_t RDDS[64];                      /*!< 0x00000600 Read Data Section [1...64] */
   __IM uint32_t RDHS1;                         /*!< 0x00000700 Read Header Section 1 */
   __IM uint32_t RDHS2;                         /*!< 0x00000704 Read Header Section 2 */
   __IM uint32_t RDHS3;                         /*!< 0x00000708 Read Header Section 3 */
   __IM uint32_t MBS;                           /*!< 0x0000070C Message Buffer Status */
  __IOM uint32_t OBCM;                          /*!< 0x00000710 Output Buffer Command Mask */
  __IOM uint32_t OBCR;                          /*!< 0x00000714 Output Buffer Command Request */
   __IM uint32_t RESERVED14[310];
  __IOM uint32_t WRHS1_MIR2;                    /*!< 0x00000BF0 Write Header Section 1 (2nd mirror) */
  __IOM uint32_t WRHS2_MIR2;                    /*!< 0x00000BF4 Write Header Section 2 (2nd mirror) */
  __IOM uint32_t WRHS3_MIR2;                    /*!< 0x00000BF8 Write Header Section 3 (2nd mirror) */
   __IM uint32_t RESERVED15;
  __IOM uint32_t WRDS_MIR[64];                  /*!< 0x00000C00 Write Data Section [1...64] (mirror) */
  __IOM uint32_t WRHS1_MIR;                     /*!< 0x00000D00 Write Header Section 1 (mirror) */
  __IOM uint32_t WRHS2_MIR;                     /*!< 0x00000D04 Write Header Section 2 (mirror) */
  __IOM uint32_t WRHS3_MIR;                     /*!< 0x00000D08 Write Header Section 3 (mirror) */
   __IM uint32_t RESERVED16;
  __IOM uint32_t IBCM_MIR;                      /*!< 0x00000D10 Input Buffer Command Mask (mirror) */
  __IOM uint32_t IBCR_MIR;                      /*!< 0x00000D14 Input Buffer Command Request (mirror) */
   __IM uint32_t RESERVED17[54];
   __IM uint32_t RDHS1_MIR2;                    /*!< 0x00000DF0 Read Header Section 1 (2nd mirror) */
   __IM uint32_t RDHS2_MIR2;                    /*!< 0x00000DF4 Read Header Section 2 (2nd mirror) */
   __IM uint32_t RDHS3_MIR2;                    /*!< 0x00000DF8 Read Header Section 3 (2nd mirror) */
   __IM uint32_t MBS_MIR2;                      /*!< 0x00000DFC Message Buffer Status  (2nd mirror) */
   __IM uint32_t RDDS_MIR[64];                  /*!< 0x00000E00 Read Data Section [1...64] (mirror) */
   __IM uint32_t RDHS1_MIR;                     /*!< 0x00000F00 Read Header Section 1 (mirror) */
   __IM uint32_t RDHS2_MIR;                     /*!< 0x00000F04 Read Header Section 2 (mirror) */
   __IM uint32_t RDHS3_MIR;                     /*!< 0x00000F08 Read Header Section 3 (mirror) */
   __IM uint32_t MBS_MIR;                       /*!< 0x00000F0C Message Buffer Status (mirror) */
  __IOM uint32_t OBCM_MIR;                      /*!< 0x00000F10 Output Buffer Command Mask (mirror) */
  __IOM uint32_t OBCR_MIR;                      /*!< 0x00000F14 Output Buffer Command Request (mirror) */
} FLEXRAY_Type;                                 /*!< Size = 3864 (0xF18) */


