RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_flexray.h
/* FLEXRAY.CTL */
#define FLEXRAY_CTL_ENABLED_Pos                 31UL
#define FLEXRAY_CTL_ENABLED_Msk                 0x80000000UL
/* FLEXRAY.DMA_CTL */
#define FLEXRAY_DMA_CTL_IDMATOE_Pos             0UL
#define FLEXRAY_DMA_CTL_IDMATOE_Msk             0x1UL
#define FLEXRAY_DMA_CTL_ODMATOE_Pos             1UL
#define FLEXRAY_DMA_CTL_ODMATOE_Msk             0x2UL
#define FLEXRAY_DMA_CTL_ODMAFFE_Pos             2UL
#define FLEXRAY_DMA_CTL_ODMAFFE_Msk             0x4UL
/* FLEXRAY.TEST1 */
#define FLEXRAY_TEST1_WRTEN_Pos                 0UL
#define FLEXRAY_TEST1_WRTEN_Msk                 0x1UL
#define FLEXRAY_TEST1_ELBE_Pos                  1UL
#define FLEXRAY_TEST1_ELBE_Msk                  0x2UL
#define FLEXRAY_TEST1_TMC_Pos                   4UL
#define FLEXRAY_TEST1_TMC_Msk                   0x30UL
#define FLEXRAY_TEST1_AOA_Pos                   8UL
#define FLEXRAY_TEST1_AOA_Msk                   0x100UL
#define FLEXRAY_TEST1_AOB_Pos                   9UL
#define FLEXRAY_TEST1_AOB_Msk                   0x200UL
#define FLEXRAY_TEST1_RXA_Pos                   16UL
#define FLEXRAY_TEST1_RXA_Msk                   0x10000UL
#define FLEXRAY_TEST1_RXB_Pos                   17UL
#define FLEXRAY_TEST1_RXB_Msk                   0x20000UL
#define FLEXRAY_TEST1_TXA_Pos                   18UL
#define FLEXRAY_TEST1_TXA_Msk                   0x40000UL
#define FLEXRAY_TEST1_TXB_Pos                   19UL
#define FLEXRAY_TEST1_TXB_Msk                   0x80000UL
#define FLEXRAY_TEST1_TXENA_Pos                 20UL
#define FLEXRAY_TEST1_TXENA_Msk                 0x100000UL
#define FLEXRAY_TEST1_TXENB_Pos                 21UL
#define FLEXRAY_TEST1_TXENB_Msk                 0x200000UL
#define FLEXRAY_TEST1_CERA_Pos                  24UL
#define FLEXRAY_TEST1_CERA_Msk                  0xF000000UL
#define FLEXRAY_TEST1_CERB_Pos                  28UL
#define FLEXRAY_TEST1_CERB_Msk                  0xF0000000UL
/* FLEXRAY.TEST2 */
#define FLEXRAY_TEST2_RS_Pos                    0UL
#define FLEXRAY_TEST2_RS_Msk                    0x7UL
#define FLEXRAY_TEST2_SSEL_Pos                  4UL
#define FLEXRAY_TEST2_SSEL_Msk                  0x70UL
#define FLEXRAY_TEST2_WRPB_Pos                  14UL
#define FLEXRAY_TEST2_WRPB_Msk                  0x4000UL
#define FLEXRAY_TEST2_RDPB_Pos                  15UL
#define FLEXRAY_TEST2_RDPB_Msk                  0x8000UL
/* FLEXRAY.LCK */
#define FLEXRAY_LCK_CLK_Pos                     0UL
#define FLEXRAY_LCK_CLK_Msk                     0xFFUL
#define FLEXRAY_LCK_TMK_Pos                     8UL
#define FLEXRAY_LCK_TMK_Msk                     0xFF00UL
/* FLEXRAY.EIR */
#define FLEXRAY_EIR_PEMC_Pos                    0UL
#define FLEXRAY_EIR_PEMC_Msk                    0x1UL
#define FLEXRAY_EIR_CNA_Pos                     1UL
#define FLEXRAY_EIR_CNA_Msk                     0x2UL
#define FLEXRAY_EIR_SFBM_Pos                    2UL
#define FLEXRAY_EIR_SFBM_Msk                    0x4UL
#define FLEXRAY_EIR_SFO_Pos                     3UL
#define FLEXRAY_EIR_SFO_Msk                     0x8UL
#define FLEXRAY_EIR_CCF_Pos                     4UL
#define FLEXRAY_EIR_CCF_Msk                     0x10UL
#define FLEXRAY_EIR_CCL_Pos                     5UL
#define FLEXRAY_EIR_CCL_Msk                     0x20UL
#define FLEXRAY_EIR_PERR_Pos                    6UL
#define FLEXRAY_EIR_PERR_Msk                    0x40UL
#define FLEXRAY_EIR_RFO_Pos                     7UL
#define FLEXRAY_EIR_RFO_Msk                     0x80UL
#define FLEXRAY_EIR_EFA_Pos                     8UL
#define FLEXRAY_EIR_EFA_Msk                     0x100UL
#define FLEXRAY_EIR_IIBA_Pos                    9UL
#define FLEXRAY_EIR_IIBA_Msk                    0x200UL
#define FLEXRAY_EIR_IOBA_Pos                    10UL
#define FLEXRAY_EIR_IOBA_Msk                    0x400UL
#define FLEXRAY_EIR_MHF_Pos                     11UL
#define FLEXRAY_EIR_MHF_Msk                     0x800UL
#define FLEXRAY_EIR_EDA_Pos                     16UL
#define FLEXRAY_EIR_EDA_Msk                     0x10000UL
#define FLEXRAY_EIR_LTVA_Pos                    17UL
#define FLEXRAY_EIR_LTVA_Msk                    0x20000UL
#define FLEXRAY_EIR_TABA_Pos                    18UL
#define FLEXRAY_EIR_TABA_Msk                    0x40000UL
#define FLEXRAY_EIR_EDB_Pos                     24UL
#define FLEXRAY_EIR_EDB_Msk                     0x1000000UL
#define FLEXRAY_EIR_LTVB_Pos                    25UL
#define FLEXRAY_EIR_LTVB_Msk                    0x2000000UL
#define FLEXRAY_EIR_TABB_Pos                    26UL
#define FLEXRAY_EIR_TABB_Msk                    0x4000000UL
/* FLEXRAY.SIR */
#define FLEXRAY_SIR_WST_Pos                     0UL
#define FLEXRAY_SIR_WST_Msk                     0x1UL
#define FLEXRAY_SIR_CAS_Pos                     1UL
#define FLEXRAY_SIR_CAS_Msk                     0x2UL
#define FLEXRAY_SIR_CYCS_Pos                    2UL
#define FLEXRAY_SIR_CYCS_Msk                    0x4UL
#define FLEXRAY_SIR_TXI_Pos                     3UL
#define FLEXRAY_SIR_TXI_Msk                     0x8UL
#define FLEXRAY_SIR_RXI_Pos                     4UL
#define FLEXRAY_SIR_RXI_Msk                     0x10UL
#define FLEXRAY_SIR_RFNE_Pos                    5UL
#define FLEXRAY_SIR_RFNE_Msk                    0x20UL
#define FLEXRAY_SIR_RFCL_Pos                    6UL
#define FLEXRAY_SIR_RFCL_Msk                    0x40UL
#define FLEXRAY_SIR_NMVC_Pos                    7UL
#define FLEXRAY_SIR_NMVC_Msk                    0x80UL
#define FLEXRAY_SIR_TI0_Pos                     8UL
#define FLEXRAY_SIR_TI0_Msk                     0x100UL
#define FLEXRAY_SIR_TI1_Pos                     9UL
#define FLEXRAY_SIR_TI1_Msk                     0x200UL
#define FLEXRAY_SIR_TIBC_Pos                    10UL
#define FLEXRAY_SIR_TIBC_Msk                    0x400UL
#define FLEXRAY_SIR_TOBC_Pos                    11UL
#define FLEXRAY_SIR_TOBC_Msk                    0x800UL
#define FLEXRAY_SIR_SWE_Pos                     12UL
#define FLEXRAY_SIR_SWE_Msk                     0x1000UL
#define FLEXRAY_SIR_SUCS_Pos                    13UL
#define FLEXRAY_SIR_SUCS_Msk                    0x2000UL
#define FLEXRAY_SIR_MBSI_Pos                    14UL
#define FLEXRAY_SIR_MBSI_Msk                    0x4000UL
#define FLEXRAY_SIR_SDS_Pos                     15UL
#define FLEXRAY_SIR_SDS_Msk                     0x8000UL
#define FLEXRAY_SIR_WUPA_Pos                    16UL
#define FLEXRAY_SIR_WUPA_Msk                    0x10000UL
#define FLEXRAY_SIR_MTSA_Pos                    17UL
#define FLEXRAY_SIR_MTSA_Msk                    0x20000UL
#define FLEXRAY_SIR_WUPB_Pos                    24UL
#define FLEXRAY_SIR_WUPB_Msk                    0x1000000UL
#define FLEXRAY_SIR_MTSB_Pos                    25UL
#define FLEXRAY_SIR_MTSB_Msk                    0x2000000UL
/* FLEXRAY.EILS */
#define FLEXRAY_EILS_PEMCL_Pos                  0UL
#define FLEXRAY_EILS_PEMCL_Msk                  0x1UL
#define FLEXRAY_EILS_CNAL_Pos                   1UL
#define FLEXRAY_EILS_CNAL_Msk                   0x2UL
#define FLEXRAY_EILS_SFBML_Pos                  2UL
#define FLEXRAY_EILS_SFBML_Msk                  0x4UL
#define FLEXRAY_EILS_SFOL_Pos                   3UL
#define FLEXRAY_EILS_SFOL_Msk                   0x8UL
#define FLEXRAY_EILS_CCFL_Pos                   4UL
#define FLEXRAY_EILS_CCFL_Msk                   0x10UL
#define FLEXRAY_EILS_CCLL_Pos                   5UL
#define FLEXRAY_EILS_CCLL_Msk                   0x20UL
#define FLEXRAY_EILS_PERRL_Pos                  6UL
#define FLEXRAY_EILS_PERRL_Msk                  0x40UL
#define FLEXRAY_EILS_RFOL_Pos                   7UL
#define FLEXRAY_EILS_RFOL_Msk                   0x80UL
#define FLEXRAY_EILS_EFAL_Pos                   8UL
#define FLEXRAY_EILS_EFAL_Msk                   0x100UL
#define FLEXRAY_EILS_IIBAL_Pos                  9UL
#define FLEXRAY_EILS_IIBAL_Msk                  0x200UL
#define FLEXRAY_EILS_IOBAL_Pos                  10UL
#define FLEXRAY_EILS_IOBAL_Msk                  0x400UL
#define FLEXRAY_EILS_MHFL_Pos                   11UL
#define FLEXRAY_EILS_MHFL_Msk                   0x800UL
#define FLEXRAY_EILS_EDAL_Pos                   16UL
#define FLEXRAY_EILS_EDAL_Msk                   0x10000UL
#define FLEXRAY_EILS_LTVAL_Pos                  17UL
#define FLEXRAY_EILS_LTVAL_Msk                  0x20000UL
#define FLEXRAY_EILS_TABAL_Pos                  18UL
#define FLEXRAY_EILS_TABAL_Msk                  0x40000UL
#define FLEXRAY_EILS_EDBL_Pos                   24UL
#define FLEXRAY_EILS_EDBL_Msk                   0x1000000UL
#define FLEXRAY_EILS_LTVBL_Pos                  25UL
#define FLEXRAY_EILS_LTVBL_Msk                  0x2000000UL
#define FLEXRAY_EILS_TABBL_Pos                  26UL
#define FLEXRAY_EILS_TABBL_Msk                  0x4000000UL
/* FLEXRAY.SILS */
#define FLEXRAY_SILS_WSTL_Pos                   0UL
#define FLEXRAY_SILS_WSTL_Msk                   0x1UL
#define FLEXRAY_SILS_CASL_Pos                   1UL
#define FLEXRAY_SILS_CASL_Msk                   0x2UL
#define FLEXRAY_SILS_CYCSL_Pos                  2UL
#define FLEXRAY_SILS_CYCSL_Msk                  0x4UL
#define FLEXRAY_SILS_TXIL_Pos                   3UL
#define FLEXRAY_SILS_TXIL_Msk                   0x8UL
#define FLEXRAY_SILS_RXIL_Pos                   4UL
#define FLEXRAY_SILS_RXIL_Msk                   0x10UL
#define FLEXRAY_SILS_RFNEL_Pos                  5UL
#define FLEXRAY_SILS_RFNEL_Msk                  0x20UL
#define FLEXRAY_SILS_RFCLL_Pos                  6UL
#define FLEXRAY_SILS_RFCLL_Msk                  0x40UL
#define FLEXRAY_SILS_NMVCL_Pos                  7UL
#define FLEXRAY_SILS_NMVCL_Msk                  0x80UL
#define FLEXRAY_SILS_TI0L_Pos                   8UL
#define FLEXRAY_SILS_TI0L_Msk                   0x100UL
#define FLEXRAY_SILS_TI1L_Pos                   9UL
#define FLEXRAY_SILS_TI1L_Msk                   0x200UL
#define FLEXRAY_SILS_TIBCL_Pos                  10UL
#define FLEXRAY_SILS_TIBCL_Msk                  0x400UL
#define FLEXRAY_SILS_TOBCL_Pos                  11UL
#define FLEXRAY_SILS_TOBCL_Msk                  0x800UL
#define FLEXRAY_SILS_SWEL_Pos                   12UL
#define FLEXRAY_SILS_SWEL_Msk                   0x1000UL
#define FLEXRAY_SILS_SUCSL_Pos                  13UL
#define FLEXRAY_SILS_SUCSL_Msk                  0x2000UL
#define FLEXRAY_SILS_MBSIL_Pos                  14UL
#define FLEXRAY_SILS_MBSIL_Msk                  0x4000UL
#define FLEXRAY_SILS_SDSL_Pos                   15UL
#define FLEXRAY_SILS_SDSL_Msk                   0x8000UL
#define FLEXRAY_SILS_WUPAL_Pos                  16UL
#define FLEXRAY_SILS_WUPAL_Msk                  0x10000UL
#define FLEXRAY_SILS_MTSAL_Pos                  17UL
#define FLEXRAY_SILS_MTSAL_Msk                  0x20000UL
#define FLEXRAY_SILS_WUPBL_Pos                  24UL
#define FLEXRAY_SILS_WUPBL_Msk                  0x1000000UL
#define FLEXRAY_SILS_MTSBL_Pos                  25UL
#define FLEXRAY_SILS_MTSBL_Msk                  0x2000000UL
/* FLEXRAY.EIES */
#define FLEXRAY_EIES_PEMCE_Pos                  0UL
#define FLEXRAY_EIES_PEMCE_Msk                  0x1UL
#define FLEXRAY_EIES_CNAE_Pos                   1UL
#define FLEXRAY_EIES_CNAE_Msk                   0x2UL
#define FLEXRAY_EIES_SFBME_Pos                  2UL
#define FLEXRAY_EIES_SFBME_Msk                  0x4UL
#define FLEXRAY_EIES_SFOE_Pos                   3UL
#define FLEXRAY_EIES_SFOE_Msk                   0x8UL
#define FLEXRAY_EIES_CCFE_Pos                   4UL
#define FLEXRAY_EIES_CCFE_Msk                   0x10UL
#define FLEXRAY_EIES_CCLE_Pos                   5UL
#define FLEXRAY_EIES_CCLE_Msk                   0x20UL
#define FLEXRAY_EIES_PERRE_Pos                  6UL
#define FLEXRAY_EIES_PERRE_Msk                  0x40UL
#define FLEXRAY_EIES_RFOE_Pos                   7UL
#define FLEXRAY_EIES_RFOE_Msk                   0x80UL
#define FLEXRAY_EIES_EFAE_Pos                   8UL
#define FLEXRAY_EIES_EFAE_Msk                   0x100UL
#define FLEXRAY_EIES_IIBAE_Pos                  9UL
#define FLEXRAY_EIES_IIBAE_Msk                  0x200UL
#define FLEXRAY_EIES_IOBAE_Pos                  10UL
#define FLEXRAY_EIES_IOBAE_Msk                  0x400UL
#define FLEXRAY_EIES_MHFE_Pos                   11UL
#define FLEXRAY_EIES_MHFE_Msk                   0x800UL
#define FLEXRAY_EIES_EDAE_Pos                   16UL
#define FLEXRAY_EIES_EDAE_Msk                   0x10000UL
#define FLEXRAY_EIES_LTVAE_Pos                  17UL
#define FLEXRAY_EIES_LTVAE_Msk                  0x20000UL
#define FLEXRAY_EIES_TABAE_Pos                  18UL
#define FLEXRAY_EIES_TABAE_Msk                  0x40000UL
#define FLEXRAY_EIES_EDBE_Pos                   24UL
#define FLEXRAY_EIES_EDBE_Msk                   0x1000000UL
#define FLEXRAY_EIES_LTVBE_Pos                  25UL
#define FLEXRAY_EIES_LTVBE_Msk                  0x2000000UL
#define FLEXRAY_EIES_TABBE_Pos                  26UL
#define FLEXRAY_EIES_TABBE_Msk                  0x4000000UL
/* FLEXRAY.EIER */
#define FLEXRAY_EIER_PEMCE_Pos                  0UL
#define FLEXRAY_EIER_PEMCE_Msk                  0x1UL
#define FLEXRAY_EIER_CNAE_Pos                   1UL
#define FLEXRAY_EIER_CNAE_Msk                   0x2UL
#define FLEXRAY_EIER_SFBME_Pos                  2UL
#define FLEXRAY_EIER_SFBME_Msk                  0x4UL
#define FLEXRAY_EIER_SFOE_Pos                   3UL
#define FLEXRAY_EIER_SFOE_Msk                   0x8UL
#define FLEXRAY_EIER_CCFE_Pos                   4UL
#define FLEXRAY_EIER_CCFE_Msk                   0x10UL
#define FLEXRAY_EIER_CCLE_Pos                   5UL
#define FLEXRAY_EIER_CCLE_Msk                   0x20UL
#define FLEXRAY_EIER_PERRE_Pos                  6UL
#define FLEXRAY_EIER_PERRE_Msk                  0x40UL
#define FLEXRAY_EIER_RFOE_Pos                   7UL
#define FLEXRAY_EIER_RFOE_Msk                   0x80UL
#define FLEXRAY_EIER_EFAE_Pos                   8UL
#define FLEXRAY_EIER_EFAE_Msk                   0x100UL
#define FLEXRAY_EIER_IIBAE_Pos                  9UL
#define FLEXRAY_EIER_IIBAE_Msk                  0x200UL
#define FLEXRAY_EIER_IOBAE_Pos                  10UL
#define FLEXRAY_EIER_IOBAE_Msk                  0x400UL
#define FLEXRAY_EIER_MHFE_Pos                   11UL
#define FLEXRAY_EIER_MHFE_Msk                   0x800UL
#define FLEXRAY_EIER_EDAE_Pos                   16UL
#define FLEXRAY_EIER_EDAE_Msk                   0x10000UL
#define FLEXRAY_EIER_LTVAE_Pos                  17UL
#define FLEXRAY_EIER_LTVAE_Msk                  0x20000UL
#define FLEXRAY_EIER_TABAE_Pos                  18UL
#define FLEXRAY_EIER_TABAE_Msk                  0x40000UL
#define FLEXRAY_EIER_EDBE_Pos                   24UL
#define FLEXRAY_EIER_EDBE_Msk                   0x1000000UL
#define FLEXRAY_EIER_LTVBE_Pos                  25UL
#define FLEXRAY_EIER_LTVBE_Msk                  0x2000000UL
#define FLEXRAY_EIER_TABBE_Pos                  26UL
#define FLEXRAY_EIER_TABBE_Msk                  0x4000000UL
/* FLEXRAY.SIES */
#define FLEXRAY_SIES_WSTE_Pos                   0UL
#define FLEXRAY_SIES_WSTE_Msk                   0x1UL
#define FLEXRAY_SIES_CASE_Pos                   1UL
#define FLEXRAY_SIES_CASE_Msk                   0x2UL
#define FLEXRAY_SIES_CYCSE_Pos                  2UL
#define FLEXRAY_SIES_CYCSE_Msk                  0x4UL
#define FLEXRAY_SIES_TXIE_Pos                   3UL
#define FLEXRAY_SIES_TXIE_Msk                   0x8UL
#define FLEXRAY_SIES_RXIE_Pos                   4UL
#define FLEXRAY_SIES_RXIE_Msk                   0x10UL
#define FLEXRAY_SIES_RFNEE_Pos                  5UL
#define FLEXRAY_SIES_RFNEE_Msk                  0x20UL
#define FLEXRAY_SIES_RFCLE_Pos                  6UL
#define FLEXRAY_SIES_RFCLE_Msk                  0x40UL
#define FLEXRAY_SIES_NMVCE_Pos                  7UL
#define FLEXRAY_SIES_NMVCE_Msk                  0x80UL
#define FLEXRAY_SIES_TI0E_Pos                   8UL
#define FLEXRAY_SIES_TI0E_Msk                   0x100UL
#define FLEXRAY_SIES_TI1E_Pos                   9UL
#define FLEXRAY_SIES_TI1E_Msk                   0x200UL
#define FLEXRAY_SIES_TIBCE_Pos                  10UL
#define FLEXRAY_SIES_TIBCE_Msk                  0x400UL
#define FLEXRAY_SIES_TOBCE_Pos                  11UL
#define FLEXRAY_SIES_TOBCE_Msk                  0x800UL
#define FLEXRAY_SIES_SWEE_Pos                   12UL
#define FLEXRAY_SIES_SWEE_Msk                   0x1000UL
#define FLEXRAY_SIES_SUCSE_Pos                  13UL
#define FLEXRAY_SIES_SUCSE_Msk                  0x2000UL
#define FLEXRAY_SIES_MBSIE_Pos                  14UL
#define FLEXRAY_SIES_MBSIE_Msk                  0x4000UL
#define FLEXRAY_SIES_SDSE_Pos                   15UL
#define FLEXRAY_SIES_SDSE_Msk                   0x8000UL
#define FLEXRAY_SIES_WUPAE_Pos                  16UL
#define FLEXRAY_SIES_WUPAE_Msk                  0x10000UL
#define FLEXRAY_SIES_MTSAE_Pos                  17UL
#define FLEXRAY_SIES_MTSAE_Msk                  0x20000UL
#define FLEXRAY_SIES_WUPBE_Pos                  24UL
#define FLEXRAY_SIES_WUPBE_Msk                  0x1000000UL
#define FLEXRAY_SIES_MTSBE_Pos                  25UL
#define FLEXRAY_SIES_MTSBE_Msk                  0x2000000UL
/* FLEXRAY.SIER */
#define FLEXRAY_SIER_WSTE_Pos                   0UL
#define FLEXRAY_SIER_WSTE_Msk                   0x1UL
#define FLEXRAY_SIER_CASE_Pos                   1UL
#define FLEXRAY_SIER_CASE_Msk                   0x2UL
#define FLEXRAY_SIER_CYCSE_Pos                  2UL
#define FLEXRAY_SIER_CYCSE_Msk                  0x4UL
#define FLEXRAY_SIER_TXIE_Pos                   3UL
#define FLEXRAY_SIER_TXIE_Msk                   0x8UL
#define FLEXRAY_SIER_RXIE_Pos                   4UL
#define FLEXRAY_SIER_RXIE_Msk                   0x10UL
#define FLEXRAY_SIER_RFNEE_Pos                  5UL
#define FLEXRAY_SIER_RFNEE_Msk                  0x20UL
#define FLEXRAY_SIER_RFCLE_Pos                  6UL
#define FLEXRAY_SIER_RFCLE_Msk                  0x40UL
#define FLEXRAY_SIER_NMVCE_Pos                  7UL
#define FLEXRAY_SIER_NMVCE_Msk                  0x80UL
#define FLEXRAY_SIER_TI0E_Pos                   8UL
#define FLEXRAY_SIER_TI0E_Msk                   0x100UL
#define FLEXRAY_SIER_TI1E_Pos                   9UL
#define FLEXRAY_SIER_TI1E_Msk                   0x200UL
#define FLEXRAY_SIER_TIBCE_Pos                  10UL
#define FLEXRAY_SIER_TIBCE_Msk                  0x400UL
#define FLEXRAY_SIER_TOBCE_Pos                  11UL
#define FLEXRAY_SIER_TOBCE_Msk                  0x800UL
#define FLEXRAY_SIER_SWEE_Pos                   12UL
#define FLEXRAY_SIER_SWEE_Msk                   0x1000UL
#define FLEXRAY_SIER_SUCSE_Pos                  13UL
#define FLEXRAY_SIER_SUCSE_Msk                  0x2000UL
#define FLEXRAY_SIER_MBSIE_Pos                  14UL
#define FLEXRAY_SIER_MBSIE_Msk                  0x4000UL
#define FLEXRAY_SIER_SDSE_Pos                   15UL
#define FLEXRAY_SIER_SDSE_Msk                   0x8000UL
#define FLEXRAY_SIER_WUPAE_Pos                  16UL
#define FLEXRAY_SIER_WUPAE_Msk                  0x10000UL
#define FLEXRAY_SIER_MTSAE_Pos                  17UL
#define FLEXRAY_SIER_MTSAE_Msk                  0x20000UL
#define FLEXRAY_SIER_WUPBE_Pos                  24UL
#define FLEXRAY_SIER_WUPBE_Msk                  0x1000000UL
#define FLEXRAY_SIER_MTSBE_Pos                  25UL
#define FLEXRAY_SIER_MTSBE_Msk                  0x2000000UL
/* FLEXRAY.ILE */
#define FLEXRAY_ILE_EINT0__Pos                  0UL
#define FLEXRAY_ILE_EINT0__Msk                  0x1UL
#define FLEXRAY_ILE_EINT1__Pos                  1UL
#define FLEXRAY_ILE_EINT1__Msk                  0x2UL
/* FLEXRAY.T0C */
#define FLEXRAY_T0C_T0RC_Pos                    0UL
#define FLEXRAY_T0C_T0RC_Msk                    0x1UL
#define FLEXRAY_T0C_T0MS_Pos                    1UL
#define FLEXRAY_T0C_T0MS_Msk                    0x2UL
#define FLEXRAY_T0C_T0CC_Pos                    8UL
#define FLEXRAY_T0C_T0CC_Msk                    0x7F00UL
#define FLEXRAY_T0C_T0MO_Pos                    16UL
#define FLEXRAY_T0C_T0MO_Msk                    0x3FFF0000UL
/* FLEXRAY.T1C */
#define FLEXRAY_T1C_T1RC_Pos                    0UL
#define FLEXRAY_T1C_T1RC_Msk                    0x1UL
#define FLEXRAY_T1C_T1MS_Pos                    1UL
#define FLEXRAY_T1C_T1MS_Msk                    0x2UL
#define FLEXRAY_T1C_T1MC_Pos                    16UL
#define FLEXRAY_T1C_T1MC_Msk                    0x3FFF0000UL
/* FLEXRAY.STPW1 */
#define FLEXRAY_STPW1_ESWT_Pos                  0UL
#define FLEXRAY_STPW1_ESWT_Msk                  0x1UL
#define FLEXRAY_STPW1_SWMS_Pos                  1UL
#define FLEXRAY_STPW1_SWMS_Msk                  0x2UL
#define FLEXRAY_STPW1_EDGE_Pos                  2UL
#define FLEXRAY_STPW1_EDGE_Msk                  0x4UL
#define FLEXRAY_STPW1_SSWT_Pos                  3UL
#define FLEXRAY_STPW1_SSWT_Msk                  0x8UL
#define FLEXRAY_STPW1_EETP_Pos                  4UL
#define FLEXRAY_STPW1_EETP_Msk                  0x10UL
#define FLEXRAY_STPW1_EINT0_Pos                 5UL
#define FLEXRAY_STPW1_EINT0_Msk                 0x20UL
#define FLEXRAY_STPW1_EINT1_Pos                 6UL
#define FLEXRAY_STPW1_EINT1_Msk                 0x40UL
#define FLEXRAY_STPW1_SCCV_Pos                  8UL
#define FLEXRAY_STPW1_SCCV_Msk                  0x3F00UL
#define FLEXRAY_STPW1_SMTV_Pos                  16UL
#define FLEXRAY_STPW1_SMTV_Msk                  0x3FFF0000UL
/* FLEXRAY.STPW2 */
#define FLEXRAY_STPW2_SSCVA_Pos                 0UL
#define FLEXRAY_STPW2_SSCVA_Msk                 0x7FFUL
#define FLEXRAY_STPW2_SSCVB_Pos                 16UL
#define FLEXRAY_STPW2_SSCVB_Msk                 0x7FF0000UL
/* FLEXRAY.SUCC1 */
#define FLEXRAY_SUCC1_CMD_Pos                   0UL
#define FLEXRAY_SUCC1_CMD_Msk                   0xFUL
#define FLEXRAY_SUCC1_PBSY_Pos                  7UL
#define FLEXRAY_SUCC1_PBSY_Msk                  0x80UL
#define FLEXRAY_SUCC1_TXST_Pos                  8UL
#define FLEXRAY_SUCC1_TXST_Msk                  0x100UL
#define FLEXRAY_SUCC1_TXSY_Pos                  9UL
#define FLEXRAY_SUCC1_TXSY_Msk                  0x200UL
#define FLEXRAY_SUCC1_CSA_Pos                   11UL
#define FLEXRAY_SUCC1_CSA_Msk                   0xF800UL
#define FLEXRAY_SUCC1_PTA_Pos                   16UL
#define FLEXRAY_SUCC1_PTA_Msk                   0x1F0000UL
#define FLEXRAY_SUCC1_WUCS_Pos                  21UL
#define FLEXRAY_SUCC1_WUCS_Msk                  0x200000UL
#define FLEXRAY_SUCC1_TSM_Pos                   22UL
#define FLEXRAY_SUCC1_TSM_Msk                   0x400000UL
#define FLEXRAY_SUCC1_HCSE_Pos                  23UL
#define FLEXRAY_SUCC1_HCSE_Msk                  0x800000UL
#define FLEXRAY_SUCC1_MTSA__Pos                 24UL
#define FLEXRAY_SUCC1_MTSA__Msk                 0x1000000UL
#define FLEXRAY_SUCC1_MTSB__Pos                 25UL
#define FLEXRAY_SUCC1_MTSB__Msk                 0x2000000UL
#define FLEXRAY_SUCC1_CCHA_Pos                  26UL
#define FLEXRAY_SUCC1_CCHA_Msk                  0x4000000UL
#define FLEXRAY_SUCC1_CCHB_Pos                  27UL
#define FLEXRAY_SUCC1_CCHB_Msk                  0x8000000UL
/* FLEXRAY.SUCC2 */
#define FLEXRAY_SUCC2_LT_Pos                    0UL
#define FLEXRAY_SUCC2_LT_Msk                    0x1FFFFFUL
#define FLEXRAY_SUCC2_LTN_Pos                   24UL
#define FLEXRAY_SUCC2_LTN_Msk                   0xF000000UL
/* FLEXRAY.SUCC3 */
#define FLEXRAY_SUCC3_WCP_Pos                   0UL
#define FLEXRAY_SUCC3_WCP_Msk                   0xFUL
#define FLEXRAY_SUCC3_WCF_Pos                   4UL
#define FLEXRAY_SUCC3_WCF_Msk                   0xF0UL
/* FLEXRAY.NEMC */
#define FLEXRAY_NEMC_NML_Pos                    0UL
#define FLEXRAY_NEMC_NML_Msk                    0xFUL
/* FLEXRAY.PRTC1 */
#define FLEXRAY_PRTC1_TSST_Pos                  0UL
#define FLEXRAY_PRTC1_TSST_Msk                  0xFUL
#define FLEXRAY_PRTC1_CASM_Pos                  4UL
#define FLEXRAY_PRTC1_CASM_Msk                  0x3F0UL
#define FLEXRAY_PRTC1_CASM6_Pos                 10UL
#define FLEXRAY_PRTC1_CASM6_Msk                 0x400UL
#define FLEXRAY_PRTC1_SPP_Pos                   12UL
