RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_flexray.h
#define FLEXRAY_PRTC1_SPP_Msk                   0x3000UL
#define FLEXRAY_PRTC1_BRP_Pos                   14UL
#define FLEXRAY_PRTC1_BRP_Msk                   0xC000UL
#define FLEXRAY_PRTC1_RXW_Pos                   16UL
#define FLEXRAY_PRTC1_RXW_Msk                   0x1FF0000UL
#define FLEXRAY_PRTC1_RWP_Pos                   26UL
#define FLEXRAY_PRTC1_RWP_Msk                   0xFC000000UL
/* FLEXRAY.PRTC2 */
#define FLEXRAY_PRTC2_RXI__Pos                  0UL
#define FLEXRAY_PRTC2_RXI__Msk                  0x3FUL
#define FLEXRAY_PRTC2_RXL_Pos                   8UL
#define FLEXRAY_PRTC2_RXL_Msk                   0x3F00UL
#define FLEXRAY_PRTC2_TXI__Pos                  16UL
#define FLEXRAY_PRTC2_TXI__Msk                  0xFF0000UL
#define FLEXRAY_PRTC2_TXL_Pos                   24UL
#define FLEXRAY_PRTC2_TXL_Msk                   0x3F000000UL
/* FLEXRAY.MHDC */
#define FLEXRAY_MHDC_SFDL_Pos                   0UL
#define FLEXRAY_MHDC_SFDL_Msk                   0x7FUL
#define FLEXRAY_MHDC_SLT_Pos                    16UL
#define FLEXRAY_MHDC_SLT_Msk                    0x1FFF0000UL
/* FLEXRAY.GTUC1 */
#define FLEXRAY_GTUC1_UT_Pos                    0UL
#define FLEXRAY_GTUC1_UT_Msk                    0xFFFFFUL
/* FLEXRAY.GTUC2 */
#define FLEXRAY_GTUC2_MPC_Pos                   0UL
#define FLEXRAY_GTUC2_MPC_Msk                   0x3FFFUL
#define FLEXRAY_GTUC2_SNM_Pos                   16UL
#define FLEXRAY_GTUC2_SNM_Msk                   0xF0000UL
/* FLEXRAY.GTUC3 */
#define FLEXRAY_GTUC3_UIOA_Pos                  0UL
#define FLEXRAY_GTUC3_UIOA_Msk                  0xFFUL
#define FLEXRAY_GTUC3_UIOB_Pos                  8UL
#define FLEXRAY_GTUC3_UIOB_Msk                  0xFF00UL
#define FLEXRAY_GTUC3_MIOA_Pos                  16UL
#define FLEXRAY_GTUC3_MIOA_Msk                  0x7F0000UL
#define FLEXRAY_GTUC3_MIOB_Pos                  24UL
#define FLEXRAY_GTUC3_MIOB_Msk                  0x7F000000UL
/* FLEXRAY.GTUC4 */
#define FLEXRAY_GTUC4_NIT_Pos                   0UL
#define FLEXRAY_GTUC4_NIT_Msk                   0x3FFFUL
#define FLEXRAY_GTUC4_OCS_Pos                   16UL
#define FLEXRAY_GTUC4_OCS_Msk                   0x3FFF0000UL
/* FLEXRAY.GTUC5 */
#define FLEXRAY_GTUC5_DCA_Pos                   0UL
#define FLEXRAY_GTUC5_DCA_Msk                   0xFFUL
#define FLEXRAY_GTUC5_DCB_Pos                   8UL
#define FLEXRAY_GTUC5_DCB_Msk                   0xFF00UL
#define FLEXRAY_GTUC5_CDD_Pos                   16UL
#define FLEXRAY_GTUC5_CDD_Msk                   0x1F0000UL
#define FLEXRAY_GTUC5_DEC_Pos                   24UL
#define FLEXRAY_GTUC5_DEC_Msk                   0xFF000000UL
/* FLEXRAY.GTUC6 */
#define FLEXRAY_GTUC6_ASR_Pos                   0UL
#define FLEXRAY_GTUC6_ASR_Msk                   0x7FFUL
#define FLEXRAY_GTUC6_MOD_Pos                   16UL
#define FLEXRAY_GTUC6_MOD_Msk                   0x7FF0000UL
/* FLEXRAY.GTUC7 */
#define FLEXRAY_GTUC7_SSL_Pos                   0UL
#define FLEXRAY_GTUC7_SSL_Msk                   0x3FFUL
#define FLEXRAY_GTUC7_NSS_Pos                   16UL
#define FLEXRAY_GTUC7_NSS_Msk                   0x3FF0000UL
/* FLEXRAY.GTUC8 */
#define FLEXRAY_GTUC8_MSL_Pos                   0UL
#define FLEXRAY_GTUC8_MSL_Msk                   0x3FUL
#define FLEXRAY_GTUC8_NMS_Pos                   16UL
#define FLEXRAY_GTUC8_NMS_Msk                   0x1FFF0000UL
/* FLEXRAY.GTUC9 */
#define FLEXRAY_GTUC9_APO_Pos                   0UL
#define FLEXRAY_GTUC9_APO_Msk                   0x3FUL
#define FLEXRAY_GTUC9_MAPO_Pos                  8UL
#define FLEXRAY_GTUC9_MAPO_Msk                  0x1F00UL
#define FLEXRAY_GTUC9_DSI_Pos                   16UL
#define FLEXRAY_GTUC9_DSI_Msk                   0x30000UL
/* FLEXRAY.GTUC10 */
#define FLEXRAY_GTUC10_MOC_Pos                  0UL
#define FLEXRAY_GTUC10_MOC_Msk                  0x3FFFUL
#define FLEXRAY_GTUC10_MRC_Pos                  16UL
#define FLEXRAY_GTUC10_MRC_Msk                  0x7FF0000UL
/* FLEXRAY.GTUC11 */
#define FLEXRAY_GTUC11_EOCC_Pos                 0UL
#define FLEXRAY_GTUC11_EOCC_Msk                 0x3UL
#define FLEXRAY_GTUC11_ERCC_Pos                 8UL
#define FLEXRAY_GTUC11_ERCC_Msk                 0x300UL
#define FLEXRAY_GTUC11_EOC_Pos                  16UL
#define FLEXRAY_GTUC11_EOC_Msk                  0x70000UL
#define FLEXRAY_GTUC11_ERC_Pos                  24UL
#define FLEXRAY_GTUC11_ERC_Msk                  0x7000000UL
/* FLEXRAY.CCSV */
#define FLEXRAY_CCSV_POCS_Pos                   0UL
#define FLEXRAY_CCSV_POCS_Msk                   0x3FUL
#define FLEXRAY_CCSV_FSI_Pos                    6UL
#define FLEXRAY_CCSV_FSI_Msk                    0x40UL
#define FLEXRAY_CCSV_HRQ_Pos                    7UL
#define FLEXRAY_CCSV_HRQ_Msk                    0x80UL
#define FLEXRAY_CCSV_SLM_Pos                    8UL
#define FLEXRAY_CCSV_SLM_Msk                    0x300UL
#define FLEXRAY_CCSV_CSNI_Pos                   12UL
#define FLEXRAY_CCSV_CSNI_Msk                   0x1000UL
#define FLEXRAY_CCSV_CSAI_Pos                   13UL
#define FLEXRAY_CCSV_CSAI_Msk                   0x2000UL
#define FLEXRAY_CCSV_CSI_Pos                    14UL
#define FLEXRAY_CCSV_CSI_Msk                    0x4000UL
#define FLEXRAY_CCSV_WSV_Pos                    16UL
#define FLEXRAY_CCSV_WSV_Msk                    0x70000UL
#define FLEXRAY_CCSV_RCA_Pos                    19UL
#define FLEXRAY_CCSV_RCA_Msk                    0xF80000UL
#define FLEXRAY_CCSV_PSL_Pos                    24UL
#define FLEXRAY_CCSV_PSL_Msk                    0x3F000000UL
/* FLEXRAY.CCEV */
#define FLEXRAY_CCEV_CCFC_Pos                   0UL
#define FLEXRAY_CCEV_CCFC_Msk                   0xFUL
#define FLEXRAY_CCEV_ERRM_Pos                   6UL
#define FLEXRAY_CCEV_ERRM_Msk                   0xC0UL
#define FLEXRAY_CCEV_PTAC_Pos                   8UL
#define FLEXRAY_CCEV_PTAC_Msk                   0x1F00UL
/* FLEXRAY.SCV */
#define FLEXRAY_SCV_SCCA_Pos                    0UL
#define FLEXRAY_SCV_SCCA_Msk                    0x7FFUL
#define FLEXRAY_SCV_SCCB_Pos                    16UL
#define FLEXRAY_SCV_SCCB_Msk                    0x7FF0000UL
/* FLEXRAY.MTCCV */
#define FLEXRAY_MTCCV_MTV_Pos                   0UL
#define FLEXRAY_MTCCV_MTV_Msk                   0x3FFFUL
#define FLEXRAY_MTCCV_CCV_Pos                   16UL
#define FLEXRAY_MTCCV_CCV_Msk                   0x3F0000UL
/* FLEXRAY.RCV */
#define FLEXRAY_RCV_RCV_Pos                     0UL
#define FLEXRAY_RCV_RCV_Msk                     0xFFFUL
/* FLEXRAY.OCV */
#define FLEXRAY_OCV_OCV_Pos                     0UL
#define FLEXRAY_OCV_OCV_Msk                     0x7FFFFUL
/* FLEXRAY.SFS */
#define FLEXRAY_SFS_VSAE_Pos                    0UL
#define FLEXRAY_SFS_VSAE_Msk                    0xFUL
#define FLEXRAY_SFS_VSAO_Pos                    4UL
#define FLEXRAY_SFS_VSAO_Msk                    0xF0UL
#define FLEXRAY_SFS_VSBE_Pos                    8UL
#define FLEXRAY_SFS_VSBE_Msk                    0xF00UL
#define FLEXRAY_SFS_VSBO_Pos                    12UL
#define FLEXRAY_SFS_VSBO_Msk                    0xF000UL
#define FLEXRAY_SFS_MOCS_Pos                    16UL
#define FLEXRAY_SFS_MOCS_Msk                    0x10000UL
#define FLEXRAY_SFS_OCLR_Pos                    17UL
#define FLEXRAY_SFS_OCLR_Msk                    0x20000UL
#define FLEXRAY_SFS_MRCS_Pos                    18UL
#define FLEXRAY_SFS_MRCS_Msk                    0x40000UL
#define FLEXRAY_SFS_RCLR_Pos                    19UL
#define FLEXRAY_SFS_RCLR_Msk                    0x80000UL
/* FLEXRAY.SWNIT */
#define FLEXRAY_SWNIT_SESA_Pos                  0UL
#define FLEXRAY_SWNIT_SESA_Msk                  0x1UL
#define FLEXRAY_SWNIT_SBSA_Pos                  1UL
#define FLEXRAY_SWNIT_SBSA_Msk                  0x2UL
#define FLEXRAY_SWNIT_TCSA_Pos                  2UL
#define FLEXRAY_SWNIT_TCSA_Msk                  0x4UL
#define FLEXRAY_SWNIT_SESB_Pos                  3UL
#define FLEXRAY_SWNIT_SESB_Msk                  0x8UL
#define FLEXRAY_SWNIT_SBSB_Pos                  4UL
#define FLEXRAY_SWNIT_SBSB_Msk                  0x10UL
#define FLEXRAY_SWNIT_TCSB_Pos                  5UL
#define FLEXRAY_SWNIT_TCSB_Msk                  0x20UL
#define FLEXRAY_SWNIT_MTSA___Pos                6UL
#define FLEXRAY_SWNIT_MTSA___Msk                0x40UL
#define FLEXRAY_SWNIT_MTSB___Pos                7UL
#define FLEXRAY_SWNIT_MTSB___Msk                0x80UL
#define FLEXRAY_SWNIT_SENA_Pos                  8UL
#define FLEXRAY_SWNIT_SENA_Msk                  0x100UL
#define FLEXRAY_SWNIT_SBNA_Pos                  9UL
#define FLEXRAY_SWNIT_SBNA_Msk                  0x200UL
#define FLEXRAY_SWNIT_SENB_Pos                  10UL
#define FLEXRAY_SWNIT_SENB_Msk                  0x400UL
#define FLEXRAY_SWNIT_SBNB_Pos                  11UL
#define FLEXRAY_SWNIT_SBNB_Msk                  0x800UL
/* FLEXRAY.ACS */
#define FLEXRAY_ACS_VFRA__Pos                   0UL
#define FLEXRAY_ACS_VFRA__Msk                   0x1UL
#define FLEXRAY_ACS_SEDA_Pos                    1UL
#define FLEXRAY_ACS_SEDA_Msk                    0x2UL
#define FLEXRAY_ACS_CEDA_Pos                    2UL
#define FLEXRAY_ACS_CEDA_Msk                    0x4UL
#define FLEXRAY_ACS_CIA_Pos                     3UL
#define FLEXRAY_ACS_CIA_Msk                     0x8UL
#define FLEXRAY_ACS_SBVA_Pos                    4UL
#define FLEXRAY_ACS_SBVA_Msk                    0x10UL
#define FLEXRAY_ACS_VFRB__Pos                   8UL
#define FLEXRAY_ACS_VFRB__Msk                   0x100UL
#define FLEXRAY_ACS_SEDB_Pos                    9UL
#define FLEXRAY_ACS_SEDB_Msk                    0x200UL
#define FLEXRAY_ACS_CEDB_Pos                    10UL
#define FLEXRAY_ACS_CEDB_Msk                    0x400UL
#define FLEXRAY_ACS_CIB_Pos                     11UL
#define FLEXRAY_ACS_CIB_Msk                     0x800UL
#define FLEXRAY_ACS_SBVB_Pos                    12UL
#define FLEXRAY_ACS_SBVB_Msk                    0x1000UL
/* FLEXRAY.ESID */
#define FLEXRAY_ESID_EID_Pos                    0UL
#define FLEXRAY_ESID_EID_Msk                    0x3FFUL
#define FLEXRAY_ESID_RXEA_Pos                   14UL
#define FLEXRAY_ESID_RXEA_Msk                   0x4000UL
#define FLEXRAY_ESID_RXEB_Pos                   15UL
#define FLEXRAY_ESID_RXEB_Msk                   0x8000UL
/* FLEXRAY.OSID */
#define FLEXRAY_OSID_OID_Pos                    0UL
#define FLEXRAY_OSID_OID_Msk                    0x3FFUL
#define FLEXRAY_OSID_RXOA_Pos                   14UL
#define FLEXRAY_OSID_RXOA_Msk                   0x4000UL
#define FLEXRAY_OSID_RXOB_Pos                   15UL
#define FLEXRAY_OSID_RXOB_Msk                   0x8000UL
/* FLEXRAY.NMV1 */
#define FLEXRAY_NMV1_DATA0_Pos                  0UL
#define FLEXRAY_NMV1_DATA0_Msk                  0xFFUL
#define FLEXRAY_NMV1_DATA1_Pos                  8UL
#define FLEXRAY_NMV1_DATA1_Msk                  0xFF00UL
#define FLEXRAY_NMV1_DATA2_Pos                  16UL
#define FLEXRAY_NMV1_DATA2_Msk                  0xFF0000UL
#define FLEXRAY_NMV1_DATA3_Pos                  24UL
#define FLEXRAY_NMV1_DATA3_Msk                  0xFF000000UL
/* FLEXRAY.NMV2 */
#define FLEXRAY_NMV2_DATA4_Pos                  0UL
#define FLEXRAY_NMV2_DATA4_Msk                  0xFFUL
#define FLEXRAY_NMV2_DATA5_Pos                  8UL
#define FLEXRAY_NMV2_DATA5_Msk                  0xFF00UL
#define FLEXRAY_NMV2_DATA6_Pos                  16UL
#define FLEXRAY_NMV2_DATA6_Msk                  0xFF0000UL
#define FLEXRAY_NMV2_DATA7_Pos                  24UL
#define FLEXRAY_NMV2_DATA7_Msk                  0xFF000000UL
/* FLEXRAY.NMV3 */
#define FLEXRAY_NMV3_DATA8_Pos                  0UL
#define FLEXRAY_NMV3_DATA8_Msk                  0xFFUL
#define FLEXRAY_NMV3_DATA9_Pos                  8UL
#define FLEXRAY_NMV3_DATA9_Msk                  0xFF00UL
#define FLEXRAY_NMV3_DATA10_Pos                 16UL
#define FLEXRAY_NMV3_DATA10_Msk                 0xFF0000UL
#define FLEXRAY_NMV3_DATA11_Pos                 24UL
#define FLEXRAY_NMV3_DATA11_Msk                 0xFF000000UL
/* FLEXRAY.MRC */
#define FLEXRAY_MRC_FDB_Pos                     0UL
#define FLEXRAY_MRC_FDB_Msk                     0xFFUL
#define FLEXRAY_MRC_FFB_Pos                     8UL
#define FLEXRAY_MRC_FFB_Msk                     0xFF00UL
#define FLEXRAY_MRC_LCB_Pos                     16UL
#define FLEXRAY_MRC_LCB_Msk                     0xFF0000UL
#define FLEXRAY_MRC_SEC_Pos                     24UL
#define FLEXRAY_MRC_SEC_Msk                     0x3000000UL
#define FLEXRAY_MRC_SPLM_Pos                    26UL
#define FLEXRAY_MRC_SPLM_Msk                    0x4000000UL
/* FLEXRAY.FRF */
#define FLEXRAY_FRF_CH_Pos                      0UL
#define FLEXRAY_FRF_CH_Msk                      0x3UL
#define FLEXRAY_FRF_FID__Pos                    2UL
#define FLEXRAY_FRF_FID__Msk                    0x1FFCUL
#define FLEXRAY_FRF_CYF_Pos                     16UL
#define FLEXRAY_FRF_CYF_Msk                     0x7F0000UL
#define FLEXRAY_FRF_RSS_Pos                     23UL
#define FLEXRAY_FRF_RSS_Msk                     0x800000UL
#define FLEXRAY_FRF_RNF_Pos                     24UL
#define FLEXRAY_FRF_RNF_Msk                     0x1000000UL
/* FLEXRAY.FRFM */
#define FLEXRAY_FRFM_MFID_Pos                   2UL
#define FLEXRAY_FRFM_MFID_Msk                   0x1FFCUL
/* FLEXRAY.FCL */
#define FLEXRAY_FCL_CL_Pos                      0UL
#define FLEXRAY_FCL_CL_Msk                      0xFFUL
/* FLEXRAY.MHDS */
#define FLEXRAY_MHDS_PIBF_Pos                   0UL
#define FLEXRAY_MHDS_PIBF_Msk                   0x1UL
#define FLEXRAY_MHDS_POBF_Pos                   1UL
#define FLEXRAY_MHDS_POBF_Msk                   0x2UL
#define FLEXRAY_MHDS_PMR_Pos                    2UL
#define FLEXRAY_MHDS_PMR_Msk                    0x4UL
#define FLEXRAY_MHDS_PTBF1_Pos                  3UL
#define FLEXRAY_MHDS_PTBF1_Msk                  0x8UL
#define FLEXRAY_MHDS_PTBF2_Pos                  4UL
#define FLEXRAY_MHDS_PTBF2_Msk                  0x10UL
#define FLEXRAY_MHDS_FMBD_Pos                   5UL
#define FLEXRAY_MHDS_FMBD_Msk                   0x20UL
#define FLEXRAY_MHDS_MFMB_Pos                   6UL
#define FLEXRAY_MHDS_MFMB_Msk                   0x40UL
#define FLEXRAY_MHDS_CRAM_Pos                   7UL
#define FLEXRAY_MHDS_CRAM_Msk                   0x80UL
#define FLEXRAY_MHDS_FMB_Pos                    8UL
#define FLEXRAY_MHDS_FMB_Msk                    0x7F00UL
#define FLEXRAY_MHDS_MBT_Pos                    16UL
#define FLEXRAY_MHDS_MBT_Msk                    0x7F0000UL
#define FLEXRAY_MHDS_MBU_Pos                    24UL
#define FLEXRAY_MHDS_MBU_Msk                    0x7F000000UL
/* FLEXRAY.LDTS */
#define FLEXRAY_LDTS_LDTA_Pos                   0UL
#define FLEXRAY_LDTS_LDTA_Msk                   0x7FFUL
#define FLEXRAY_LDTS_LDTB_Pos                   16UL
#define FLEXRAY_LDTS_LDTB_Msk                   0x7FF0000UL
/* FLEXRAY.FSR */
#define FLEXRAY_FSR_RFNE__Pos                   0UL
#define FLEXRAY_FSR_RFNE__Msk                   0x1UL
#define FLEXRAY_FSR_RFCL__Pos                   1UL
#define FLEXRAY_FSR_RFCL__Msk                   0x2UL
#define FLEXRAY_FSR_RFO__Pos                    2UL
#define FLEXRAY_FSR_RFO__Msk                    0x4UL
#define FLEXRAY_FSR_RFFL_Pos                    8UL
#define FLEXRAY_FSR_RFFL_Msk                    0xFF00UL
/* FLEXRAY.MHDF */
#define FLEXRAY_MHDF_SNUA_Pos                   0UL
#define FLEXRAY_MHDF_SNUA_Msk                   0x1UL
#define FLEXRAY_MHDF_SNUB_Pos                   1UL
#define FLEXRAY_MHDF_SNUB_Msk                   0x2UL
#define FLEXRAY_MHDF_FNFA_Pos                   2UL
#define FLEXRAY_MHDF_FNFA_Msk                   0x4UL
#define FLEXRAY_MHDF_FNFB_Pos                   3UL
#define FLEXRAY_MHDF_FNFB_Msk                   0x8UL
#define FLEXRAY_MHDF_TBFA_Pos                   4UL
#define FLEXRAY_MHDF_TBFA_Msk                   0x10UL
#define FLEXRAY_MHDF_TBFB_Pos                   5UL
#define FLEXRAY_MHDF_TBFB_Msk                   0x20UL
#define FLEXRAY_MHDF_TNSA_Pos                   6UL
#define FLEXRAY_MHDF_TNSA_Msk                   0x40UL
#define FLEXRAY_MHDF_TNSB_Pos                   7UL
#define FLEXRAY_MHDF_TNSB_Msk                   0x80UL
#define FLEXRAY_MHDF_WAHP_Pos                   8UL
#define FLEXRAY_MHDF_WAHP_Msk                   0x100UL
/* FLEXRAY.TXRQ1 */
#define FLEXRAY_TXRQ1_TXR_Pos                   0UL
#define FLEXRAY_TXRQ1_TXR_Msk                   0xFFFFFFFFUL
/* FLEXRAY.TXRQ2 */
#define FLEXRAY_TXRQ2_TXR_Pos                   0UL
#define FLEXRAY_TXRQ2_TXR_Msk                   0xFFFFFFFFUL
/* FLEXRAY.TXRQ3 */
#define FLEXRAY_TXRQ3_TXR_Pos                   0UL
#define FLEXRAY_TXRQ3_TXR_Msk                   0xFFFFFFFFUL
/* FLEXRAY.TXRQ4 */
#define FLEXRAY_TXRQ4_TXR_Pos                   0UL
#define FLEXRAY_TXRQ4_TXR_Msk                   0xFFFFFFFFUL
/* FLEXRAY.NDAT1 */
#define FLEXRAY_NDAT1_ND_Pos                    0UL
#define FLEXRAY_NDAT1_ND_Msk                    0xFFFFFFFFUL
/* FLEXRAY.NDAT2 */
#define FLEXRAY_NDAT2_ND_Pos                    0UL
#define FLEXRAY_NDAT2_ND_Msk                    0xFFFFFFFFUL
/* FLEXRAY.NDAT3 */
#define FLEXRAY_NDAT3_ND_Pos                    0UL
#define FLEXRAY_NDAT3_ND_Msk                    0xFFFFFFFFUL
/* FLEXRAY.NDAT4 */
#define FLEXRAY_NDAT4_ND_Pos                    0UL
#define FLEXRAY_NDAT4_ND_Msk                    0xFFFFFFFFUL
/* FLEXRAY.MBSC1 */
#define FLEXRAY_MBSC1_MBC_Pos                   0UL
#define FLEXRAY_MBSC1_MBC_Msk                   0xFFFFFFFFUL
/* FLEXRAY.MBSC2 */
#define FLEXRAY_MBSC2_MBC_Pos                   0UL
#define FLEXRAY_MBSC2_MBC_Msk                   0xFFFFFFFFUL
/* FLEXRAY.MBSC3 */
#define FLEXRAY_MBSC3_MBC_Pos                   0UL
#define FLEXRAY_MBSC3_MBC_Msk                   0xFFFFFFFFUL
/* FLEXRAY.MBSC4 */
#define FLEXRAY_MBSC4_MBC_Pos                   0UL
#define FLEXRAY_MBSC4_MBC_Msk                   0xFFFFFFFFUL
/* FLEXRAY.CREL */
#define FLEXRAY_CREL_DAY_Pos                    0UL
#define FLEXRAY_CREL_DAY_Msk                    0xFFUL
#define FLEXRAY_CREL_MON_Pos                    8UL
#define FLEXRAY_CREL_MON_Msk                    0xFF00UL
#define FLEXRAY_CREL_YEAR_Pos                   16UL
#define FLEXRAY_CREL_YEAR_Msk                   0xF0000UL
#define FLEXRAY_CREL_STEP_Pos                   20UL
#define FLEXRAY_CREL_STEP_Msk                   0xFF00000UL
#define FLEXRAY_CREL_REL_Pos                    28UL
#define FLEXRAY_CREL_REL_Msk                    0xF0000000UL
/* FLEXRAY.ENDN */
#define FLEXRAY_ENDN_ETV_Pos                    0UL
#define FLEXRAY_ENDN_ETV_Msk                    0xFFFFFFFFUL
/* FLEXRAY.WRDS */
#define FLEXRAY_WRDS_MD_Pos                     0UL
#define FLEXRAY_WRDS_MD_Msk                     0xFFFFFFFFUL
/* FLEXRAY.WRHS1 */
#define FLEXRAY_WRHS1_FID_Pos                   0UL
#define FLEXRAY_WRHS1_FID_Msk                   0x7FFUL
#define FLEXRAY_WRHS1_CYC_Pos                   16UL
#define FLEXRAY_WRHS1_CYC_Msk                   0x7F0000UL
#define FLEXRAY_WRHS1_CHA_Pos                   24UL
#define FLEXRAY_WRHS1_CHA_Msk                   0x1000000UL
#define FLEXRAY_WRHS1_CHB_Pos                   25UL
#define FLEXRAY_WRHS1_CHB_Msk                   0x2000000UL
#define FLEXRAY_WRHS1_CFG_Pos                   26UL
#define FLEXRAY_WRHS1_CFG_Msk                   0x4000000UL
#define FLEXRAY_WRHS1_PPIT_Pos                  27UL
#define FLEXRAY_WRHS1_PPIT_Msk                  0x8000000UL
#define FLEXRAY_WRHS1_TXM_Pos                   28UL
#define FLEXRAY_WRHS1_TXM_Msk                   0x10000000UL
#define FLEXRAY_WRHS1_MBI_Pos                   29UL
#define FLEXRAY_WRHS1_MBI_Msk                   0x20000000UL
/* FLEXRAY.WRHS2 */
#define FLEXRAY_WRHS2_CRC_Pos                   0UL
#define FLEXRAY_WRHS2_CRC_Msk                   0x7FFUL
#define FLEXRAY_WRHS2_PLC_Pos                   16UL
#define FLEXRAY_WRHS2_PLC_Msk                   0x7F0000UL
/* FLEXRAY.WRHS3 */
#define FLEXRAY_WRHS3_DP_Pos                    0UL
#define FLEXRAY_WRHS3_DP_Msk                    0x7FFUL
/* FLEXRAY.IBCM */
#define FLEXRAY_IBCM_LHSH_Pos                   0UL
#define FLEXRAY_IBCM_LHSH_Msk                   0x1UL
#define FLEXRAY_IBCM_LDSH_Pos                   1UL
#define FLEXRAY_IBCM_LDSH_Msk                   0x2UL
#define FLEXRAY_IBCM_STXRH_Pos                  2UL
#define FLEXRAY_IBCM_STXRH_Msk                  0x4UL
#define FLEXRAY_IBCM_LHSS_Pos                   16UL
#define FLEXRAY_IBCM_LHSS_Msk                   0x10000UL
#define FLEXRAY_IBCM_LDSS_Pos                   17UL
#define FLEXRAY_IBCM_LDSS_Msk                   0x20000UL
#define FLEXRAY_IBCM_STXRS_Pos                  18UL
#define FLEXRAY_IBCM_STXRS_Msk                  0x40000UL
/* FLEXRAY.IBCR */
#define FLEXRAY_IBCR_IBRH_Pos                   0UL
#define FLEXRAY_IBCR_IBRH_Msk                   0x7FUL
#define FLEXRAY_IBCR_IBSYH_Pos                  15UL
#define FLEXRAY_IBCR_IBSYH_Msk                  0x8000UL
#define FLEXRAY_IBCR_IBRS_Pos                   16UL
#define FLEXRAY_IBCR_IBRS_Msk                   0x7F0000UL
#define FLEXRAY_IBCR_IBSYS_Pos                  31UL
#define FLEXRAY_IBCR_IBSYS_Msk                  0x80000000UL
/* FLEXRAY.RDDS */
#define FLEXRAY_RDDS_MD_Pos                     0UL
#define FLEXRAY_RDDS_MD_Msk                     0xFFFFFFFFUL
/* FLEXRAY.RDHS1 */
#define FLEXRAY_RDHS1_FID_Pos                   0UL
#define FLEXRAY_RDHS1_FID_Msk                   0x7FFUL
#define FLEXRAY_RDHS1_CYC_Pos                   16UL
#define FLEXRAY_RDHS1_CYC_Msk                   0x7F0000UL
#define FLEXRAY_RDHS1_CHA_Pos                   24UL
#define FLEXRAY_RDHS1_CHA_Msk                   0x1000000UL
#define FLEXRAY_RDHS1_CHB_Pos                   25UL
#define FLEXRAY_RDHS1_CHB_Msk                   0x2000000UL
#define FLEXRAY_RDHS1_CFG_Pos                   26UL
#define FLEXRAY_RDHS1_CFG_Msk                   0x4000000UL
#define FLEXRAY_RDHS1_PPIT_Pos                  27UL
#define FLEXRAY_RDHS1_PPIT_Msk                  0x8000000UL
#define FLEXRAY_RDHS1_TXM_Pos                   28UL
#define FLEXRAY_RDHS1_TXM_Msk                   0x10000000UL
#define FLEXRAY_RDHS1_MBI_Pos                   29UL
#define FLEXRAY_RDHS1_MBI_Msk                   0x20000000UL
/* FLEXRAY.RDHS2 */
#define FLEXRAY_RDHS2_CRC_Pos                   0UL
#define FLEXRAY_RDHS2_CRC_Msk                   0x7FFUL
#define FLEXRAY_RDHS2_PLC_Pos                   16UL
#define FLEXRAY_RDHS2_PLC_Msk                   0x7F0000UL
#define FLEXRAY_RDHS2_PLR_Pos                   24UL
#define FLEXRAY_RDHS2_PLR_Msk                   0x7F000000UL
/* FLEXRAY.RDHS3 */
#define FLEXRAY_RDHS3_DP_Pos                    0UL
#define FLEXRAY_RDHS3_DP_Msk                    0x7FFUL
#define FLEXRAY_RDHS3_RCC_Pos                   16UL
#define FLEXRAY_RDHS3_RCC_Msk                   0x3F0000UL
#define FLEXRAY_RDHS3_RCI_Pos                   24UL
#define FLEXRAY_RDHS3_RCI_Msk                   0x1000000UL
#define FLEXRAY_RDHS3_SFI_Pos                   25UL
#define FLEXRAY_RDHS3_SFI_Msk                   0x2000000UL
#define FLEXRAY_RDHS3_SYN_Pos                   26UL
#define FLEXRAY_RDHS3_SYN_Msk                   0x4000000UL
#define FLEXRAY_RDHS3_NFI_Pos                   27UL
#define FLEXRAY_RDHS3_NFI_Msk                   0x8000000UL
#define FLEXRAY_RDHS3_PPI_Pos                   28UL
#define FLEXRAY_RDHS3_PPI_Msk                   0x10000000UL
#define FLEXRAY_RDHS3_RES_Pos                   29UL
#define FLEXRAY_RDHS3_RES_Msk                   0x20000000UL
/* FLEXRAY.MBS */
#define FLEXRAY_MBS_VFRA_Pos                    0UL
#define FLEXRAY_MBS_VFRA_Msk                    0x1UL
#define FLEXRAY_MBS_VFRB_Pos                    1UL
#define FLEXRAY_MBS_VFRB_Msk                    0x2UL
#define FLEXRAY_MBS_SEOA_Pos                    2UL
#define FLEXRAY_MBS_SEOA_Msk                    0x4UL
#define FLEXRAY_MBS_SEOB_Pos                    3UL
#define FLEXRAY_MBS_SEOB_Msk                    0x8UL
#define FLEXRAY_MBS_CEOA_Pos                    4UL
#define FLEXRAY_MBS_CEOA_Msk                    0x10UL
