RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/include/ip/cyip_flexray.h
#define FLEXRAY_MBS_CEOB_Pos                    5UL
#define FLEXRAY_MBS_CEOB_Msk                    0x20UL
#define FLEXRAY_MBS_SVOA_Pos                    6UL
#define FLEXRAY_MBS_SVOA_Msk                    0x40UL
#define FLEXRAY_MBS_SVOB_Pos                    7UL
#define FLEXRAY_MBS_SVOB_Msk                    0x80UL
#define FLEXRAY_MBS_TCIA_Pos                    8UL
#define FLEXRAY_MBS_TCIA_Msk                    0x100UL
#define FLEXRAY_MBS_TCIB_Pos                    9UL
#define FLEXRAY_MBS_TCIB_Msk                    0x200UL
#define FLEXRAY_MBS_ESA_Pos                     10UL
#define FLEXRAY_MBS_ESA_Msk                     0x400UL
#define FLEXRAY_MBS_ESB_Pos                     11UL
#define FLEXRAY_MBS_ESB_Msk                     0x800UL
#define FLEXRAY_MBS_MLST_Pos                    12UL
#define FLEXRAY_MBS_MLST_Msk                    0x1000UL
#define FLEXRAY_MBS_FTA_Pos                     14UL
#define FLEXRAY_MBS_FTA_Msk                     0x4000UL
#define FLEXRAY_MBS_FTB_Pos                     15UL
#define FLEXRAY_MBS_FTB_Msk                     0x8000UL
#define FLEXRAY_MBS_CCS_Pos                     16UL
#define FLEXRAY_MBS_CCS_Msk                     0x3F0000UL
#define FLEXRAY_MBS_RCIS_Pos                    24UL
#define FLEXRAY_MBS_RCIS_Msk                    0x1000000UL
#define FLEXRAY_MBS_SFIS_Pos                    25UL
#define FLEXRAY_MBS_SFIS_Msk                    0x2000000UL
#define FLEXRAY_MBS_SYNS_Pos                    26UL
#define FLEXRAY_MBS_SYNS_Msk                    0x4000000UL
#define FLEXRAY_MBS_NFIS_Pos                    27UL
#define FLEXRAY_MBS_NFIS_Msk                    0x8000000UL
#define FLEXRAY_MBS_PPIS_Pos                    28UL
#define FLEXRAY_MBS_PPIS_Msk                    0x10000000UL
#define FLEXRAY_MBS_RESS_Pos                    29UL
#define FLEXRAY_MBS_RESS_Msk                    0x20000000UL
/* FLEXRAY.OBCM */
#define FLEXRAY_OBCM_RHSS_Pos                   0UL
#define FLEXRAY_OBCM_RHSS_Msk                   0x1UL
#define FLEXRAY_OBCM_RDSS_Pos                   1UL
#define FLEXRAY_OBCM_RDSS_Msk                   0x2UL
#define FLEXRAY_OBCM_RHSH_Pos                   16UL
#define FLEXRAY_OBCM_RHSH_Msk                   0x10000UL
#define FLEXRAY_OBCM_RDSH_Pos                   17UL
#define FLEXRAY_OBCM_RDSH_Msk                   0x20000UL
/* FLEXRAY.OBCR */
#define FLEXRAY_OBCR_OBRS_Pos                   0UL
#define FLEXRAY_OBCR_OBRS_Msk                   0x7FUL
#define FLEXRAY_OBCR_VIEW_Pos                   8UL
#define FLEXRAY_OBCR_VIEW_Msk                   0x100UL
#define FLEXRAY_OBCR_REQ_Pos                    9UL
#define FLEXRAY_OBCR_REQ_Msk                    0x200UL
#define FLEXRAY_OBCR_OBSYS_Pos                  15UL
#define FLEXRAY_OBCR_OBSYS_Msk                  0x8000UL
#define FLEXRAY_OBCR_OBRH_Pos                   16UL
#define FLEXRAY_OBCR_OBRH_Msk                   0x7F0000UL
/* FLEXRAY.WRHS1_MIR2 */
#define FLEXRAY_WRHS1_MIR2_FID_Pos              0UL
#define FLEXRAY_WRHS1_MIR2_FID_Msk              0x7FFUL
#define FLEXRAY_WRHS1_MIR2_CYC_Pos              16UL
#define FLEXRAY_WRHS1_MIR2_CYC_Msk              0x7F0000UL
#define FLEXRAY_WRHS1_MIR2_CHA_Pos              24UL
#define FLEXRAY_WRHS1_MIR2_CHA_Msk              0x1000000UL
#define FLEXRAY_WRHS1_MIR2_CHB_Pos              25UL
#define FLEXRAY_WRHS1_MIR2_CHB_Msk              0x2000000UL
#define FLEXRAY_WRHS1_MIR2_CFG_Pos              26UL
#define FLEXRAY_WRHS1_MIR2_CFG_Msk              0x4000000UL
#define FLEXRAY_WRHS1_MIR2_PPIT_Pos             27UL
#define FLEXRAY_WRHS1_MIR2_PPIT_Msk             0x8000000UL
#define FLEXRAY_WRHS1_MIR2_TXM_Pos              28UL
#define FLEXRAY_WRHS1_MIR2_TXM_Msk              0x10000000UL
#define FLEXRAY_WRHS1_MIR2_MBI_Pos              29UL
#define FLEXRAY_WRHS1_MIR2_MBI_Msk              0x20000000UL
/* FLEXRAY.WRHS2_MIR2 */
#define FLEXRAY_WRHS2_MIR2_CRC_Pos              0UL
#define FLEXRAY_WRHS2_MIR2_CRC_Msk              0x7FFUL
#define FLEXRAY_WRHS2_MIR2_PLC_Pos              16UL
#define FLEXRAY_WRHS2_MIR2_PLC_Msk              0x7F0000UL
/* FLEXRAY.WRHS3_MIR2 */
#define FLEXRAY_WRHS3_MIR2_DP_Pos               0UL
#define FLEXRAY_WRHS3_MIR2_DP_Msk               0x7FFUL
/* FLEXRAY.WRDS_MIR */
#define FLEXRAY_WRDS_MIR_MD_Pos                 0UL
#define FLEXRAY_WRDS_MIR_MD_Msk                 0xFFFFFFFFUL
/* FLEXRAY.WRHS1_MIR */
#define FLEXRAY_WRHS1_MIR_FID_Pos               0UL
#define FLEXRAY_WRHS1_MIR_FID_Msk               0x7FFUL
#define FLEXRAY_WRHS1_MIR_CYC_Pos               16UL
#define FLEXRAY_WRHS1_MIR_CYC_Msk               0x7F0000UL
#define FLEXRAY_WRHS1_MIR_CHA_Pos               24UL
#define FLEXRAY_WRHS1_MIR_CHA_Msk               0x1000000UL
#define FLEXRAY_WRHS1_MIR_CHB_Pos               25UL
#define FLEXRAY_WRHS1_MIR_CHB_Msk               0x2000000UL
#define FLEXRAY_WRHS1_MIR_CFG_Pos               26UL
#define FLEXRAY_WRHS1_MIR_CFG_Msk               0x4000000UL
#define FLEXRAY_WRHS1_MIR_PPIT_Pos              27UL
#define FLEXRAY_WRHS1_MIR_PPIT_Msk              0x8000000UL
#define FLEXRAY_WRHS1_MIR_TXM_Pos               28UL
#define FLEXRAY_WRHS1_MIR_TXM_Msk               0x10000000UL
#define FLEXRAY_WRHS1_MIR_MBI_Pos               29UL
#define FLEXRAY_WRHS1_MIR_MBI_Msk               0x20000000UL
/* FLEXRAY.WRHS2_MIR */
#define FLEXRAY_WRHS2_MIR_CRC_Pos               0UL
#define FLEXRAY_WRHS2_MIR_CRC_Msk               0x7FFUL
#define FLEXRAY_WRHS2_MIR_PLC_Pos               16UL
#define FLEXRAY_WRHS2_MIR_PLC_Msk               0x7F0000UL
/* FLEXRAY.WRHS3_MIR */
#define FLEXRAY_WRHS3_MIR_DP_Pos                0UL
#define FLEXRAY_WRHS3_MIR_DP_Msk                0x7FFUL
/* FLEXRAY.IBCM_MIR */
#define FLEXRAY_IBCM_MIR_LHSH_Pos               0UL
#define FLEXRAY_IBCM_MIR_LHSH_Msk               0x1UL
#define FLEXRAY_IBCM_MIR_LDSH_Pos               1UL
#define FLEXRAY_IBCM_MIR_LDSH_Msk               0x2UL
#define FLEXRAY_IBCM_MIR_STXRH_Pos              2UL
#define FLEXRAY_IBCM_MIR_STXRH_Msk              0x4UL
#define FLEXRAY_IBCM_MIR_LHSS_Pos               16UL
#define FLEXRAY_IBCM_MIR_LHSS_Msk               0x10000UL
#define FLEXRAY_IBCM_MIR_LDSS_Pos               17UL
#define FLEXRAY_IBCM_MIR_LDSS_Msk               0x20000UL
#define FLEXRAY_IBCM_MIR_STXRS_Pos              18UL
#define FLEXRAY_IBCM_MIR_STXRS_Msk              0x40000UL
/* FLEXRAY.IBCR_MIR */
#define FLEXRAY_IBCR_MIR_IBRH_Pos               0UL
#define FLEXRAY_IBCR_MIR_IBRH_Msk               0x7FUL
#define FLEXRAY_IBCR_MIR_IBSYH_Pos              15UL
#define FLEXRAY_IBCR_MIR_IBSYH_Msk              0x8000UL
#define FLEXRAY_IBCR_MIR_IBRS_Pos               16UL
#define FLEXRAY_IBCR_MIR_IBRS_Msk               0x7F0000UL
#define FLEXRAY_IBCR_MIR_IBSYS_Pos              31UL
#define FLEXRAY_IBCR_MIR_IBSYS_Msk              0x80000000UL
/* FLEXRAY.RDHS1_MIR2 */
#define FLEXRAY_RDHS1_MIR2_FID_Pos              0UL
#define FLEXRAY_RDHS1_MIR2_FID_Msk              0x7FFUL
#define FLEXRAY_RDHS1_MIR2_CYC_Pos              16UL
#define FLEXRAY_RDHS1_MIR2_CYC_Msk              0x7F0000UL
#define FLEXRAY_RDHS1_MIR2_CHA_Pos              24UL
#define FLEXRAY_RDHS1_MIR2_CHA_Msk              0x1000000UL
#define FLEXRAY_RDHS1_MIR2_CHB_Pos              25UL
#define FLEXRAY_RDHS1_MIR2_CHB_Msk              0x2000000UL
#define FLEXRAY_RDHS1_MIR2_CFG_Pos              26UL
#define FLEXRAY_RDHS1_MIR2_CFG_Msk              0x4000000UL
#define FLEXRAY_RDHS1_MIR2_PPIT_Pos             27UL
#define FLEXRAY_RDHS1_MIR2_PPIT_Msk             0x8000000UL
#define FLEXRAY_RDHS1_MIR2_TXM_Pos              28UL
#define FLEXRAY_RDHS1_MIR2_TXM_Msk              0x10000000UL
#define FLEXRAY_RDHS1_MIR2_MBI_Pos              29UL
#define FLEXRAY_RDHS1_MIR2_MBI_Msk              0x20000000UL
/* FLEXRAY.RDHS2_MIR2 */
#define FLEXRAY_RDHS2_MIR2_CRC_Pos              0UL
#define FLEXRAY_RDHS2_MIR2_CRC_Msk              0x7FFUL
#define FLEXRAY_RDHS2_MIR2_PLC_Pos              16UL
#define FLEXRAY_RDHS2_MIR2_PLC_Msk              0x7F0000UL
#define FLEXRAY_RDHS2_MIR2_PLR_Pos              24UL
#define FLEXRAY_RDHS2_MIR2_PLR_Msk              0x7F000000UL
/* FLEXRAY.RDHS3_MIR2 */
#define FLEXRAY_RDHS3_MIR2_DP_Pos               0UL
#define FLEXRAY_RDHS3_MIR2_DP_Msk               0x7FFUL
#define FLEXRAY_RDHS3_MIR2_RCC_Pos              16UL
#define FLEXRAY_RDHS3_MIR2_RCC_Msk              0x3F0000UL
#define FLEXRAY_RDHS3_MIR2_RCI_Pos              24UL
#define FLEXRAY_RDHS3_MIR2_RCI_Msk              0x1000000UL
#define FLEXRAY_RDHS3_MIR2_SFI_Pos              25UL
#define FLEXRAY_RDHS3_MIR2_SFI_Msk              0x2000000UL
#define FLEXRAY_RDHS3_MIR2_SYN_Pos              26UL
#define FLEXRAY_RDHS3_MIR2_SYN_Msk              0x4000000UL
#define FLEXRAY_RDHS3_MIR2_NFI_Pos              27UL
#define FLEXRAY_RDHS3_MIR2_NFI_Msk              0x8000000UL
#define FLEXRAY_RDHS3_MIR2_PPI_Pos              28UL
#define FLEXRAY_RDHS3_MIR2_PPI_Msk              0x10000000UL
#define FLEXRAY_RDHS3_MIR2_RES_Pos              29UL
#define FLEXRAY_RDHS3_MIR2_RES_Msk              0x20000000UL
/* FLEXRAY.MBS_MIR2 */
#define FLEXRAY_MBS_MIR2_VFRA_Pos               0UL
#define FLEXRAY_MBS_MIR2_VFRA_Msk               0x1UL
#define FLEXRAY_MBS_MIR2_VFRB_Pos               1UL
#define FLEXRAY_MBS_MIR2_VFRB_Msk               0x2UL
#define FLEXRAY_MBS_MIR2_SEOA_Pos               2UL
#define FLEXRAY_MBS_MIR2_SEOA_Msk               0x4UL
#define FLEXRAY_MBS_MIR2_SEOB_Pos               3UL
#define FLEXRAY_MBS_MIR2_SEOB_Msk               0x8UL
#define FLEXRAY_MBS_MIR2_CEOA_Pos               4UL
#define FLEXRAY_MBS_MIR2_CEOA_Msk               0x10UL
#define FLEXRAY_MBS_MIR2_CEOB_Pos               5UL
#define FLEXRAY_MBS_MIR2_CEOB_Msk               0x20UL
#define FLEXRAY_MBS_MIR2_SVOA_Pos               6UL
#define FLEXRAY_MBS_MIR2_SVOA_Msk               0x40UL
#define FLEXRAY_MBS_MIR2_SVOB_Pos               7UL
#define FLEXRAY_MBS_MIR2_SVOB_Msk               0x80UL
#define FLEXRAY_MBS_MIR2_TCIA_Pos               8UL
#define FLEXRAY_MBS_MIR2_TCIA_Msk               0x100UL
#define FLEXRAY_MBS_MIR2_TCIB_Pos               9UL
#define FLEXRAY_MBS_MIR2_TCIB_Msk               0x200UL
#define FLEXRAY_MBS_MIR2_ESA_Pos                10UL
#define FLEXRAY_MBS_MIR2_ESA_Msk                0x400UL
#define FLEXRAY_MBS_MIR2_ESB_Pos                11UL
#define FLEXRAY_MBS_MIR2_ESB_Msk                0x800UL
#define FLEXRAY_MBS_MIR2_MLST_Pos               12UL
#define FLEXRAY_MBS_MIR2_MLST_Msk               0x1000UL
#define FLEXRAY_MBS_MIR2_FTA_Pos                14UL
#define FLEXRAY_MBS_MIR2_FTA_Msk                0x4000UL
#define FLEXRAY_MBS_MIR2_FTB_Pos                15UL
#define FLEXRAY_MBS_MIR2_FTB_Msk                0x8000UL
#define FLEXRAY_MBS_MIR2_CCS_Pos                16UL
#define FLEXRAY_MBS_MIR2_CCS_Msk                0x3F0000UL
#define FLEXRAY_MBS_MIR2_RCIS_Pos               24UL
#define FLEXRAY_MBS_MIR2_RCIS_Msk               0x1000000UL
#define FLEXRAY_MBS_MIR2_SFIS_Pos               25UL
#define FLEXRAY_MBS_MIR2_SFIS_Msk               0x2000000UL
#define FLEXRAY_MBS_MIR2_SYNS_Pos               26UL
#define FLEXRAY_MBS_MIR2_SYNS_Msk               0x4000000UL
#define FLEXRAY_MBS_MIR2_NFIS_Pos               27UL
#define FLEXRAY_MBS_MIR2_NFIS_Msk               0x8000000UL
#define FLEXRAY_MBS_MIR2_PPIS_Pos               28UL
#define FLEXRAY_MBS_MIR2_PPIS_Msk               0x10000000UL
#define FLEXRAY_MBS_MIR2_RESS_Pos               29UL
#define FLEXRAY_MBS_MIR2_RESS_Msk               0x20000000UL
/* FLEXRAY.RDDS_MIR */
#define FLEXRAY_RDDS_MIR_MD_Pos                 0UL
#define FLEXRAY_RDDS_MIR_MD_Msk                 0xFFFFFFFFUL
/* FLEXRAY.RDHS1_MIR */
#define FLEXRAY_RDHS1_MIR_FID_Pos               0UL
#define FLEXRAY_RDHS1_MIR_FID_Msk               0x7FFUL
#define FLEXRAY_RDHS1_MIR_CYC_Pos               16UL
#define FLEXRAY_RDHS1_MIR_CYC_Msk               0x7F0000UL
#define FLEXRAY_RDHS1_MIR_CHA_Pos               24UL
#define FLEXRAY_RDHS1_MIR_CHA_Msk               0x1000000UL
#define FLEXRAY_RDHS1_MIR_CHB_Pos               25UL
#define FLEXRAY_RDHS1_MIR_CHB_Msk               0x2000000UL
#define FLEXRAY_RDHS1_MIR_CFG_Pos               26UL
#define FLEXRAY_RDHS1_MIR_CFG_Msk               0x4000000UL
#define FLEXRAY_RDHS1_MIR_PPIT_Pos              27UL
#define FLEXRAY_RDHS1_MIR_PPIT_Msk              0x8000000UL
#define FLEXRAY_RDHS1_MIR_TXM_Pos               28UL
#define FLEXRAY_RDHS1_MIR_TXM_Msk               0x10000000UL
#define FLEXRAY_RDHS1_MIR_MBI_Pos               29UL
#define FLEXRAY_RDHS1_MIR_MBI_Msk               0x20000000UL
/* FLEXRAY.RDHS2_MIR */
#define FLEXRAY_RDHS2_MIR_CRC_Pos               0UL
#define FLEXRAY_RDHS2_MIR_CRC_Msk               0x7FFUL
#define FLEXRAY_RDHS2_MIR_PLC_Pos               16UL
#define FLEXRAY_RDHS2_MIR_PLC_Msk               0x7F0000UL
#define FLEXRAY_RDHS2_MIR_PLR_Pos               24UL
#define FLEXRAY_RDHS2_MIR_PLR_Msk               0x7F000000UL
/* FLEXRAY.RDHS3_MIR */
#define FLEXRAY_RDHS3_MIR_DP_Pos                0UL
#define FLEXRAY_RDHS3_MIR_DP_Msk                0x7FFUL
#define FLEXRAY_RDHS3_MIR_RCC_Pos               16UL
#define FLEXRAY_RDHS3_MIR_RCC_Msk               0x3F0000UL
#define FLEXRAY_RDHS3_MIR_RCI_Pos               24UL
#define FLEXRAY_RDHS3_MIR_RCI_Msk               0x1000000UL
#define FLEXRAY_RDHS3_MIR_SFI_Pos               25UL
#define FLEXRAY_RDHS3_MIR_SFI_Msk               0x2000000UL
#define FLEXRAY_RDHS3_MIR_SYN_Pos               26UL
#define FLEXRAY_RDHS3_MIR_SYN_Msk               0x4000000UL
#define FLEXRAY_RDHS3_MIR_NFI_Pos               27UL
#define FLEXRAY_RDHS3_MIR_NFI_Msk               0x8000000UL
#define FLEXRAY_RDHS3_MIR_PPI_Pos               28UL
#define FLEXRAY_RDHS3_MIR_PPI_Msk               0x10000000UL
#define FLEXRAY_RDHS3_MIR_RES_Pos               29UL
#define FLEXRAY_RDHS3_MIR_RES_Msk               0x20000000UL
/* FLEXRAY.MBS_MIR */
#define FLEXRAY_MBS_MIR_VFRA_Pos                0UL
#define FLEXRAY_MBS_MIR_VFRA_Msk                0x1UL
#define FLEXRAY_MBS_MIR_VFRB_Pos                1UL
#define FLEXRAY_MBS_MIR_VFRB_Msk                0x2UL
#define FLEXRAY_MBS_MIR_SEOA_Pos                2UL
#define FLEXRAY_MBS_MIR_SEOA_Msk                0x4UL
#define FLEXRAY_MBS_MIR_SEOB_Pos                3UL
#define FLEXRAY_MBS_MIR_SEOB_Msk                0x8UL
#define FLEXRAY_MBS_MIR_CEOA_Pos                4UL
#define FLEXRAY_MBS_MIR_CEOA_Msk                0x10UL
#define FLEXRAY_MBS_MIR_CEOB_Pos                5UL
#define FLEXRAY_MBS_MIR_CEOB_Msk                0x20UL
#define FLEXRAY_MBS_MIR_SVOA_Pos                6UL
#define FLEXRAY_MBS_MIR_SVOA_Msk                0x40UL
#define FLEXRAY_MBS_MIR_SVOB_Pos                7UL
#define FLEXRAY_MBS_MIR_SVOB_Msk                0x80UL
#define FLEXRAY_MBS_MIR_TCIA_Pos                8UL
#define FLEXRAY_MBS_MIR_TCIA_Msk                0x100UL
#define FLEXRAY_MBS_MIR_TCIB_Pos                9UL
#define FLEXRAY_MBS_MIR_TCIB_Msk                0x200UL
#define FLEXRAY_MBS_MIR_ESA_Pos                 10UL
#define FLEXRAY_MBS_MIR_ESA_Msk                 0x400UL
#define FLEXRAY_MBS_MIR_ESB_Pos                 11UL
#define FLEXRAY_MBS_MIR_ESB_Msk                 0x800UL
#define FLEXRAY_MBS_MIR_MLST_Pos                12UL
#define FLEXRAY_MBS_MIR_MLST_Msk                0x1000UL
#define FLEXRAY_MBS_MIR_FTA_Pos                 14UL
#define FLEXRAY_MBS_MIR_FTA_Msk                 0x4000UL
#define FLEXRAY_MBS_MIR_FTB_Pos                 15UL
#define FLEXRAY_MBS_MIR_FTB_Msk                 0x8000UL
#define FLEXRAY_MBS_MIR_CCS_Pos                 16UL
#define FLEXRAY_MBS_MIR_CCS_Msk                 0x3F0000UL
#define FLEXRAY_MBS_MIR_RCIS_Pos                24UL
#define FLEXRAY_MBS_MIR_RCIS_Msk                0x1000000UL
#define FLEXRAY_MBS_MIR_SFIS_Pos                25UL
#define FLEXRAY_MBS_MIR_SFIS_Msk                0x2000000UL
#define FLEXRAY_MBS_MIR_SYNS_Pos                26UL
#define FLEXRAY_MBS_MIR_SYNS_Msk                0x4000000UL
#define FLEXRAY_MBS_MIR_NFIS_Pos                27UL
#define FLEXRAY_MBS_MIR_NFIS_Msk                0x8000000UL
#define FLEXRAY_MBS_MIR_PPIS_Pos                28UL
#define FLEXRAY_MBS_MIR_PPIS_Msk                0x10000000UL
#define FLEXRAY_MBS_MIR_RESS_Pos                29UL
#define FLEXRAY_MBS_MIR_RESS_Msk                0x20000000UL
/* FLEXRAY.OBCM_MIR */
#define FLEXRAY_OBCM_MIR_RHSS_Pos               0UL
#define FLEXRAY_OBCM_MIR_RHSS_Msk               0x1UL
#define FLEXRAY_OBCM_MIR_RDSS_Pos               1UL
#define FLEXRAY_OBCM_MIR_RDSS_Msk               0x2UL
#define FLEXRAY_OBCM_MIR_RHSH_Pos               16UL
#define FLEXRAY_OBCM_MIR_RHSH_Msk               0x10000UL
#define FLEXRAY_OBCM_MIR_RDSH_Pos               17UL
#define FLEXRAY_OBCM_MIR_RDSH_Msk               0x20000UL
/* FLEXRAY.OBCR_MIR */
#define FLEXRAY_OBCR_MIR_OBRS_Pos               0UL
#define FLEXRAY_OBCR_MIR_OBRS_Msk               0x7FUL
#define FLEXRAY_OBCR_MIR_VIEW_Pos               8UL
#define FLEXRAY_OBCR_MIR_VIEW_Msk               0x100UL
#define FLEXRAY_OBCR_MIR_REQ_Pos                9UL
#define FLEXRAY_OBCR_MIR_REQ_Msk                0x200UL
#define FLEXRAY_OBCR_MIR_OBSYS_Pos              15UL
#define FLEXRAY_OBCR_MIR_OBSYS_Msk              0x8000UL
#define FLEXRAY_OBCR_MIR_OBRH_Pos               16UL
#define FLEXRAY_OBCR_MIR_OBRH_Msk               0x7F0000UL


#endif /* _CYIP_FLEXRAY_H_ */


/* [] END OF FILE */
